{
  "AALI.JK": {
    "Industry": "farm-products",
    "Sector": "Consumer Defensive",
    "Summary": "PT Astra Agro Lestari Tbk engages in the palm oil business in Indonesia. The company was founded in 1988 and is headquartered in Jakarta, Indonesia. PT Astra Agro Lestari Tbk is a subsidiary of PT Astra International Tbk."
  },
  "ACST.JK": {
    "Industry": "engineering-construction",
    "Sector": "Industrials",
    "Summary": "PT Acset Indonusa Tbk provides construction and related support services in Indonesia. It operates through three segments: Construction, Construction Support Services, and Trading. The company builds office blocks, mall and shopping area, hotel and high-rise residential, industrial building, and other projects, as well as silos, power plants, and toll-roads. It also undertakes demolition, foundation, building and civil construction, and infrastructure projects, as well as mechanical, electrical, and plumbing works. In addition, it is involved in the wholesale of heavy equipment; and provision of construction support services. The company was incorporated in 1995 and is headquartered in Jakarta, Indonesia. PT Acset Indonusa Tbk operates as a subsidiary of PT Karya Supra Perkasa."
  },
  "ADCP.JK": {
    "Industry": "real-estate-development",
    "Sector": "Real Estate",
    "Summary": "PT Adhi Commuter Properti Tbk operates as a mass transportation-based property developer in Indonesia. It is also involved in hotel management, construction, real estate trading activities. The company was founded in 2018 and is based in Jakarta Timur, Indonesia. PT Adhi Commuter Properti Tbk operates as a subsidiary of PT Adhi Karya (Persero) Tbk."
  },
  "ADHI.JK": {
    "Industry": "engineering-construction",
    "Sector": "Industrials",
    "Summary": "PT Adhi Karya (Persero) Tbk engages in the engineering and construction, property and hospitality, manufacturing, and investment and concession business in Indonesia. The company constructs civil works and high-rise buildings, including public facilities, such as airports, ports and docks, roads and bridges, dams and irrigation channels, and others; and power plants, oil and gas, and industrial plants. It also develops high-rise building areas for commercial, office and residential apartments, and hotels; and residential areas, landed houses, office houses, shop houses, and shopping centers in land development and in developing residential designs. In addition, the company engages in the manufacturing of materials and components of finished products for construction sector; and engineering, procurement, and construction activities in the railway sector. Further, it involved in the infrastructure investment activities, as well as drinking water and mineral water industry. The company was formerly known as PN Adhi Karya and changed its name to PT Adhi Karya (Persero) Tbk in 1974. PT Adhi Karya (Persero) Tbk was founded in 1960 and is headquartered in Jakarta, Indonesia."
  },
  "ADMF.JK": {
    "Industry": "credit-services",
    "Sector": "Financial Services",
    "Summary": "PT Adira Dinamika Multi Finance Tbk provides consumer financing, murabahah financing, and finance leasing services in Indonesia. It also provides sharia financing, which includes investment financing, working capital financing, multipurpose financing, and other financing business. The company was founded in 1990 and is headquartered in Jakarta Selatan, Indonesia. PT Adira Dinamika Multi Finance Tbk operates as a subsidiary of PT Bank Danamon Indonesia Tbk.   PT Adira Finance operates as an auto finance firm. The company is based in Indonesia. PT Adira Dinamika Multi Finance Tbk operates as a subsidiary of PT Bank Danamon Indonesia Tbk."
  },
  "ADMR.JK": {
    "Industry": "thermal-coal",
    "Sector": "Energy",
    "Summary": "PT Adaro Minerals Indonesia Tbk, together with its subsidiaries, engages in metallurgical coal mining and trading business in Indonesia. The company holds interest in five CCOWs mining concessions located in East Kalimantan and Central Kalimantan covering an area of approximately 146,579 hectares. It also provides management consulting services. The company was formerly known as PT Jasapower Indonesia and changed its name to PT Adaro Minerals Indonesia Tbk in September 2021. The company was founded in 2007 and is headquartered in South Jakarta, Indonesia. PT Adaro Minerals Indonesia Tbk operates as a subsidiary of PT Adaro Energy Indonesia Tbk."
  },
  "AGRO.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Raya Indonesia Tbk engages in the provision of various corporate, retail, micro, and consumer banking products and services in Indonesia. It accepts current accounts, savings account, and time deposits. The company's loan products include investment, working capital, cash collateral, SHT, construction, housing, personal, agro car, retirement, agro griya, and multipurpose loans, as well as KKPE, KPEN RP, and commercial KKPA program loans. It also offers export/import transaction, LLG and RTGS transfer, bank guarantee, credit cards, domestic letter of credit, foreign currency transaction, clearing, and foreign exchange transaction services, as well as save deposit boxes. In addition, the company provides mobile and Internet banking, treasury banking services, virtual accounts, cash management systems, and ATM cards. It operates through branch, sub-branch, community branch, and cash offices. The company was formerly known as PT Bank Rakyat Indonesia Agroniaga Tbk and changed its name to PT Bank Raya Indonesia Tbk in September 2021. PT Bank Raya Indonesia Tbk was founded in 1989 and is headquartered in Jakarta Selatan, Indonesia. PT Bank Raya Indonesia Tbk operates as a subsidiary of PT Bank Rakyat Indonesia (Persero) Tbk."
  },
  "AKRA.JK": {
    "Industry": "oil-gas-refining-marketing",
    "Sector": "Energy",
    "Summary": "PT AKR Corporindo Tbk, a logistics and supply chain company, engages in distribution and trading of petroleum and basic chemical products primarily in Indonesia. It operates through four segments: Trading and Distribution, Logistics Services, Manufacturing, and Industrial Estate. The Trading and Distribution segment distributes petroleum products and various basic chemicals, such as caustic soda, sodium sulphate, PVC resins, and soda ash. The Logistics Services segment offers various logistics services, including rental of storage tanks and warehouses, bagging, port handling, and transportation services primarily for liquid and solid chemical, and petroleum products. The Manufacturing segment produces and sells adhesive materials. The Industrial Estate segment leases and sells industrial and port estates. The company was formerly known as PT Aneka Kimia Raya Tbk and changed its name to PT AKR Corporindo Tbk in September 2004. The company was incorporated in 1977 and is headquartered in Jakarta, Indonesia. PT AKR Corporindo Tbk is a subsidiary of PT Arthakencana Rayatama."
  },
  "AMFG.JK": {
    "Industry": "building-products-equipment",
    "Sector": "Industrials",
    "Summary": "PT Asahimas Flat Glass Tbk manufactures and sells flat and safety glass products in Indonesia. It operates in Flat Glass and Automotive Glass segments. The Flat Glass segment offers a range of clear and tinted, figured, reflective, coated, and mirror glass which are used primarily for glass curtain walls, window glass, and suspended glass in building construction and as raw materials in downstream industry. The Automotive Glass segment provides tempered and laminated glasses that are principally used in the automotive industry. The company also provides automotive glass repair and installation services. It also exports and imports its products. PT Asahimas Flat Glass Tbk was founded in 1971 and is headquartered in North Jakarta, Indonesia."
  },
  "AMMN.JK": {
    "Industry": "other-precious-metals-mining",
    "Sector": "Basic Materials",
    "Summary": "PT Amman Mineral Internasional Tbk operates as a copper and gold mining company in Indonesia. It holds interests in the Batu Hijau mine and Elang project located on the island of Sumbawa. The company also provides professional and technical personnel for mining and support departments; and management services of human resources. In addition, it builds and operates purification facilities for copper concentrate and anode-sludge. Further, the company engages in real estate and hospitality activities. The company was founded in 2015 and is headquartered in South Jakarta, Indonesia."
  },
  "AMRT.JK": {
    "Industry": "grocery-stores",
    "Sector": "Consumer Defensive",
    "Summary": "PT Sumber Alfaria Trijaya Tbk engages in the retail distribution of consumer products in Indonesia. The company's stores offer food and non-food products. It also provides transportation and freight forwarding services; and operates a pharmacy, as well as engages in the retail distribution of cosmetics. PT Sumber Alfaria Trijaya Tbk operates minimarket networks and franchise services under the Alfamart name, as well as sells through the internet. The company was founded in 1989 and is headquartered in Tangerang, Indonesia. PT Sumber Alfaria Trijaya Tbk is a subsidiary of PT Sigmantara Alfindo."
  },
  "ANJT.JK": {
    "Industry": "farm-products",
    "Sector": "Consumer Defensive",
    "Summary": "PT Austindo Nusantara Jaya Tbk, together with its subsidiaries, engages in the oil palm plantation business in Indonesia. The company operates through four segments: Palm Oil, Sago, Energy, and Others. It offers crude palm oil, palm kernel, and palm kernel oil, as well as fresh fruit bunches. The company is also involved in harvesting and processing dry sago starch under the PATI ALAM and SAPAPUA brands; and cultivating edamame, as well as frozen edamame under the Edashi brand. In addition, it generates electricity through methane gas plants. The company was formerly known as PT Austindo Teguh Jaya and changed its name to PT Austindo Nusantara Jaya Tbk in July 1998. PT Austindo Nusantara Jaya Tbk was founded in 1993 and is headquartered in Jakarta, Indonesia."
  },
  "ARCI.JK": {
    "Industry": "gold",
    "Sector": "Basic Materials",
    "Summary": "PT Archi Indonesia Tbk, through its subsidiaries, engages in the mining, trading, and processing of gold properties in Indonesia. It holds 100% interest in the Toka Tindung Gold Mine located in North Sulawesi. The company also has interests in concession areas that covers an area of 8,969 hectares and 30,848 hectares. In addition, it provides mining contractor services; gold minted bar products; and management consulting services, including tax, legal, human resources, and others. PT Archi Indonesia Tbk was incorporated in 2010 and is headquartered in Jakarta Selatan, Indonesia. PT Archi Indonesia Tbk operates as a subsidiary of PT Rajawali Corpora."
  },
  "ARNA.JK": {
    "Industry": "building-products-equipment",
    "Sector": "Industrials",
    "Summary": "PT Arwana Citramulia Tbk, together with its subsidiaries, manufactures and distributes ceramic tiles in Indonesia. It sells its products under the Arna, Arwana Ceramics, and UNO brands. The company was formerly known as PT Arwana Citra Mulia and changed its name to PT Arwana Citramulia Tbk in November 1993. PT Arwana Citramulia Tbk was founded in 1993 and is headquartered in Jakarta, Indonesia."
  },
  "ARTO.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Jago Tbk provides various banking products and services for small and medium enterprises in Indonesia. The company accepts current and savings accounts, and time deposits, as well as Mudharabah deposits; and offers working capital credit, investment credit, consumer credit, multipurpose credit, and working capital financing with murabahah bil wakalah contract, as well as provides bank guarantees. It also offers bill payment, remittance/RTGS/SKN, inter-cities warkat invoices, in-city warkat invoices clearing, ATM, and customer fund account services, as well as debit cards. The company was formerly known as PT Bank Artos Indonesia Tbk and changed its name to PT Bank Jago Tbk in June 2020. PT Bank Jago Tbk was founded in 1992 and is headquartered in Jakarta, Indonesia."
  },
  "ASGR.JK": {
    "Industry": "specialty-business-services",
    "Sector": "Industrials",
    "Summary": "PT Astra Graphia Tbk engages in trading, industrial, consulting, office equipment and supplies contractor services, information technology, telecommunications, and investment businesses. It operates in three segments: Document Solution, Information Technology Solution, and Office Services Solution. The Document Solution segment offers hardware and solution based services that include various aspects of the document cycle comprising document input, such as creating, scanning, merging, editing, and capturing, as well as the document management, including sharing, indexing, storing, archiving, and distributing, and document output consisting of printing, faxing, scanning, copying, emailing, and web viewing. This segment also provides digital printing services, such as transactional printing and printing on demand, as well as document imaging and its delivery. The Information Technology Solution segment offers hardware and software solutions; IT solutions and infrastructure services; and IT software development and managed services, including data center and cloud services. The Office Services Solution segment provides general office needs, such as outsourcing service solutions in the form of document printing production, distribution services, and general office services, including office supplies, office equipment, electronic goods, and consumer goods. The company was founded in 1975 and is headquartered in Jakarta, Indonesia. PT Astra Graphia Tbk is a subsidiary of PT Astra International Tbk."
  },
  "ASII.JK": {
    "Industry": "auto-parts",
    "Sector": "Consumer Cyclical",
    "Summary": "PT Astra International Tbk, together with its subsidiaries, operates in the automotive, financial services, heavy equipment, mining, construction, energy, agri, infrastructure and logistics, information technology, and property businesses in Indonesia and internationally. It provides cars, trucks, and motorcycles of various brands; manufactures and distributes automotive components for vehicle manufacturer and retail consumers; consultation services to its customers; financing for cars, motorcycles, and heavy equipment; and life, vehicle, and health insurance, as well as other insurance for commercial business. The company also distributes heavy equipment machineries; provides coal mining contracting services; operates coal mines; and engages in crude palm oil plantation business. In addition, it is involved in the operation of toll roads; rental of vehicles; sale of used cars; and provision of logistics and warehousing services, as well as freight forwarding service through ground, sea, and air transportation. Further, the company offers various information technology business solutions based on document, office, and information technology; undertakes commercial and residential projects, as well as property development works. Additionally, it is involved in the foundation; formwork and bekisting; pump services; mechanical, electrical, and plumbing activities; and dredging, reclamation, and marine works. The company was incorporated in 1957 and is headquartered in Jakarta, Indonesia. PT Astra International Tbk operates as a subsidiary of Jardine Cycle & Carriage Limited."
  },
  "AUTO.JK": {
    "Industry": "auto-parts",
    "Sector": "Consumer Cyclical",
    "Summary": "PT Astra Otoparts Tbk manufactures, sells, distributes, and exports spare parts for two-wheelers and four-wheelers in Indonesia, rest of Asia, the Middle East, the United States, Europe, and Africa. It operates through Trading and Automotive Component Manufacturing segments. The company offers automotive spare parts, chains, and filters; rubber and metal components; jacks and tools; plastic components; automotive batteries; automotive pistons; wheel rims and frame chassis for vehicles; and vehicles transmission components, as well as cutting steel and heat treatment services. It markets and distributes spare parts for replacement markets and original equipment manufacturer through a distribution network of dealers, sales offices, and retail shops in Indonesia. The company was formerly known as PT Astra Dian Lestari and changed its name to PT Astra Otoparts Tbk in November 1997. PT Astra Otoparts Tbk was founded in 1976 and is headquartered in Jakarta, Indonesia. PT Astra Otoparts Tbk is a subsidiary of PT Astra International Tbk."
  },
  "AVIA.JK": {
    "Industry": "specialty-chemicals",
    "Sector": "Basic Materials",
    "Summary": "PT Avia Avian Tbk manufactures and distributes paints and building materials in Indonesia. The company operates in two segments, Architectural Solutions and Trading Goods. The company manufactures base paint, metal paint, wood paint, wall paint, boat paint, epoxy and enamel paint, and lacquer, including the industries of processed pigments and dyes, opacifers, enamel polish, coatings and other preparatives, printing inks, and art paints. It offers varnishes, such as organic composite solvents and thinners; paint or varnish removers, and mastics; lacquer, including the industries of putty and plaster or putty compounds and non-refractory putty or similar surface-covering materials. In addition, the company provides adhesives/glues for industrial or household purposes comprising starch, bone adhesives, cellulose esters and ethers, phenol formaldehyde, urea formaldehyde, melamine formaldehyde, and epoxy adhesives; and manufactures ready-mixed and dry-mixed concrete and mortar. Further, it produces artificial resins and plastic raw materials, including as alkyds, polyesters, aminos, polyamides, epoxides, silicones, polyurethanes, polyethylene, polypropylene, polystyrene, polyvinyl chloride, cellulose acetate, and cellulose nitrate; organic chemicals, dyes, and pigments along with their cyclical intermediates, such as phenol intermediates and their derivatives, textile dyes, and dyes for food and medicine; metal or canned containers, such as food or beverage cans, paint or other chemical cans, barrels, drums, buckets, boxes, jerrycans, and others. Additionally, the company engages in the retail trade of construction materials, such as base, metal, wood, and wall paints; enamel, putty, and plaster; and sells pipes, furniture, and supporting products needed for painting process, such as paint rollers, paint brushes, seal tapes, and sandpapers. PT Avia Avian Tbk was founded in 1978 and is headquartered in Surabaya, Indonesia."
  },
  "BALI.JK": {
    "Industry": "telecom-services",
    "Sector": "Communication Services",
    "Summary": "PT Bali Towerindo Sentra Tbk, together with its subsidiaries, engages in tower and telecommunication infrastructure business in Indonesia. The company operates and leases tower buildings or telecommunications towers, and telecommunications facilities; and provides tower facilities equipped with integrated transmission facilities through fiber optic and wireless transmission network. It also offers information and communication technology, and pay television broadcasting and management services; and leases BTS tower. The company was founded in 2006 and is headquartered in Bali, Indonesia. PT Bali Towerindo Sentra Tbk is a subsidiary of PT Kharisma Cipta Towerindo."
  },
  "BBCA.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Central Asia Tbk, together with its subsidiaries, provides banking products and services to individual, corporate, and small and medium enterprise customers in Indonesia and internationally. It offers savings accounts; motorcycle financing and vehicle, housing, and personal loans; mutual funds and bonds; insurance, including property, life, accident, auto, health, education, retirement, travel, and heritage protection; electronic money services; credit cards; business collection services; and eBanking, remittance, and customer services. The company also provides investment financing and business, investment, multipurpose business, and working capital loans; corporate financial management solutions; and treasury and custodian services, such as fixed income, custodian, money market, and foreign currency services. In addition, it offers auto and multipurpose financing, money lending and remittance, securities brokerage dealing and securities issuance underwriting, general insurance, Sharia banking, and venture capital services. PT Bank Central Asia Tbk was founded in 1955 and is headquartered in Jakarta, Indonesia. PT Bank Central Asia Tbk  operates as a subsidiary of  PT Dwimuria Investama Andalan."
  },
  "BBHI.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Allo Bank Indonesia Tbk provides various banking products and services in Indonesia. The company offers savings and current accounts; time deposits; and working capital, investment, and consumer loans. It also provides transfer, bill payment, and cash out services; and digital banking services. The company was formerly known as PT Bank Harda Internasional Tbk and changed its name to PT Allo Bank Indonesia Tbk in June 2021. The company was founded in 1992 and is headquartered in South Jakarta, Indonesia. PT Allo Bank Indonesia Tbk operates as a subsidiary of PT Mega Corpora."
  },
  "BBNI.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Negara Indonesia (Persero) Tbk, together with its subsidiaries, provides various banking products and services in Indonesia, New York, Europe, and Asia. It operates through, Corporate & International Banking, Institutional Banking, Enterprise & commercial Banking, Consumer Banking, Treasury, Head Offices, and Subsidiaries segments. The company offers savings account, savings plan and FIPF, loans, credit cards, simulation services, and others; and business banking, funding, lending, international trade financing, financial institution products, smart remittances, foreign direct investment, treasury products, and Solusi wholesale services, as well as services for micro small and medium enterprises. It also provides e-banking services, that includes ATM, phone banking, SMS notification, SMS banking, mobile banking, mobile services, BNI ipay, BNI Smartpay, BNI Agen46, BNI EDC, BNI debit online, internet payment gateway, open digital savings account, and QRIS, as well as wealth management services. In addition, the company offers life insurance, financing, securities, and venture capital services. PT Bank Negara Indonesia (Persero) Tbk was founded in 1946 and is headquartered in Jakarta Pusat, Indonesia."
  },
  "BBRI.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Rakyat Indonesia (Persero) Tbk provides various banking products and services in Indonesia and internationally. The company offers savings and current accounts; foreign currency, on call, and other deposits; mortgage, working capital, investment, franchise, and cash collateral loans, as well as supply chain financing and bank guarantees; and micro, small and medium, and program loans. It also provides bill payment, deposit acceptance, online transaction, remittance, money transfer, business, financial, institutional, treasury and global, custodian, trustee, and cash management services. In addition, the company offers investment products and services; trade and finance services, including import and export, standby L/C, BRI RTE online system services, and letters of credit; cards; and wealth management, and business internet and digital banking services. Further, it provides life and general insurance, securities, and venture capital services. The company was founded in 1895 and is headquartered in Jakarta, Indonesia."
  },
  "BBTN.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Tabungan Negara (Persero) Tbk provides various banking products and services in Indonesia. The company offers savings, current, and deposit accounts; consumer and commercial credit; mobile and internet banking services; cash management; and other services. The company was formerly known as Bank Tabungan Pos and changed its name to PT Bank Tabungan Negara (Persero) Tbk in 1963. PT Bank Tabungan Negara (Persero) Tbk was founded in 1897 and is headquartered in Jakarta, Indonesia."
  },
  "BBYB.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Neo Commerce Tbk provides various commercial banking products and services in Indonesia. It operates through three segments: Loan, Funding, and Treasury. The company offers funding products, such as current accounts, savings accounts, time deposits, and on-call deposits; wealth management products, that includes mutual funds and bank assurance services; and financial products, such as pension loan, channeling loan, multi-purpose loan, mortgage, personal loan, working capital loans, investment loan, direct loan, and other services. It also provides foreign exchange, factoring, credit card, trustee, leasing, insurance, and fund placement services. The company was formerly known as PT Bank Yudha Bhakti Tbk and changed its name to PT Bank Neo Commerce in September 2020. PT Bank Neo Commerce Tbk was founded in 1989 and is headquartered in Jakarta Selatan, Indonesia."
  },
  "BDMN.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Danamon Indonesia Tbk provides banking and financial products and services for consumers, small medium enterprises, and commercial and corporate customers in Indonesia. It operates through Retail and Wholesale segments. The company offers savings, checking, and current accounts; time and Sharia deposits; safe deposit box; and credit and debit cards. It also provides unsecured personal loans, mortgages, Sharia housing loans, and automotive and business financing services; Sharia leasing; employee cooperative, working capital, investment, trade, and financial supply chain financing; and cash management services comprising account, collection, payment, and liquidity management services. In addition, the company offers treasury products consisting of foreign exchange, interest rate swap and cross currency swap, debt securities, structured products, marketable securities, money market, and repo/reverse repo products and services; Shariah business and personal products; personal, investment related, dual-purpose life, health, and general insurance; investment products, such as mutual funds and bonds; bancassurance; trade finance; custody; project financing; debt capital market; and other solutions. Further, it provides a network of ATMs; e-banking and mobile applications; and SMS banking and call center services. The company was formerly known as Bank Kopra Indonesia and changed its name to PT Bank Danamon Indonesia Tbk in 1976. The company was incorporated in 1956 and is headquartered in Jakarta, Indonesia. PT Bank Danamon Indonesia Tbk  operates as a subsidiary of MUFG Bank, Ltd."
  },
  "BFIN.JK": {
    "Industry": "credit-services",
    "Sector": "Financial Services",
    "Summary": "PT BFI Finance Indonesia Tbk provides investment, working capital, multipurpose, sharia, and other financing services. The company operates through Cars, Motorcycles, and Others segments. It provides financing for new and used cars purchased via dealers; and finance for the purchase, sale and leaseback of heavy equipment, machinery, motor vehicles, and other equipment in new or used condition. The company also offers sharia financing, such as umrah financing, halal travel financing, financing of various goods and services, education financing, motorized vehicle financing, and sharia refinancing services; and property financing services. In addition, it offers funding facility; project and infrastructure financing products; and factoring services. The company was formerly known as PT Bunas Finance Indonesia Tbk and changed its name to PT BFI Finance Indonesia Tbk in June 2001. PT BFI Finance Indonesia Tbk was founded in 1982 and is headquartered in Tangerang Selatan, Indonesia."
  },
  "BISI.JK": {
    "Industry": "agricultural-inputs",
    "Sector": "Basic Materials",
    "Summary": "PT BISI International Tbk, together with its subsidiaries, engages in the production and sale of hybrid seeds, horticulture seeds, rice seeds, and agriculture products in Indonesia and internationally. It operates through Corn, Vegetable and Fruit, Paddy, Pesticides and Fertilizers, and Others segments. It offers hybrid corn seeds; horticulture seeds such as sweet corn seed, peppers, cucumbers, bittergourd, cabbage, seedless watermelon, tomatoes, broccoli, cauliflower, loofah, and eggplants; and pesticides, herbicides, fungicides, plant growth regulators, gluten, fishisida, and others. The company was formerly known as PT Benihinti Suburintani and changed its name to PT BISI International Tbk in October 2006. PT BISI International Tbk was founded in 1983 and is headquartered in Sidoarjo, Indonesia."
  },
  "BJBR.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Pembangunan Daerah Jawa Barat dan Banten Tbk, together with its subsidiaries, provides banking products and services to individual and corporate customers in Indonesia. The company operates through two segments, Conventional and the Sharia. It offers current, savings, time, and call money deposits, as well as certificates of deposit and deposit on calls; consumer, working capital, small business, and short-term loans; supply chain finance, cash collateral credit, and bank guarantee facilities; and card and debit cards. The company also provides treasury, insurance, mutual fund, foreign exchange, cash management, trade finance, e-banking, and safe deposit box services. It operates through a network of offices, which include functional offices, branch offices, sub-branch offices, cash offices, and other offices. The company was formerly known as PT Bank Pembangunan Daerah Jawa Barat and changed its name to PT Bank Pembangunan Daerah Jawa Barat dan Banten Tbk in November 2007. PT Bank Pembangunan Daerah Jawa Barat dan Banten Tbk was founded in 1961 and is headquartered in Bandung, Indonesia."
  },
  "BJTM.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Pembangunan Daerah Jawa Timur Tbk provides various banking products and services in Indonesia. The company offers savings and current accounts, and time deposits; consumer and productive loans; and commercial, corporate and syndicated loan products, such as transactional contract contractor, standby, contractor, general installment working capital, current account working capital, investment property construction, syndicated, loans to regional public service agencies (BLUD), receivable financing, local government, and trade finance loans. It also provides micro, retail, and program loan products; treasury products, including general foreign exchange bank notes, and deposit on call; trade finance products, consisting of export, import, and domestic transactions; business services comprising bank reference, national clearing, real time gross settlement, rupiah collection, foreign exchange collection, giralization, BPD net online, east java electronic transfer system (JETS), JConnect invest, and remittance transaction; and services, bill payment, salary payroll, and trade transaction services. In addition, the company offers Sharia financing products; Sharia funding products and services; and other services, such as SMS banking, internet banking, mobile banking, debit and prepaid cards, safe deposit box, electronic civil servant card, and money transfer services. PT Bank Pembangunan Daerah Jawa Timur Tbk was founded in 1961 and is headquartered in Surabaya, Indonesia."
  },
  "BMRI.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Mandiri (Persero) Tbk provides various banking products and services to individuals and businesses in Indonesia, Singapore, Hong Kong, Timor Leste, Shanghai, Malaysia, the United Kingdom, and the Cayman Islands. The company operates through Wholesale and Retail segments. It offers savings and current accounts, time deposits, demand deposits, and foreign currency savings and current accounts; motorcycle loans, mortgage loan, and housing loans, as well as loans for various purposes, such as education, home renovation, marriage, health, and other needs for individuals; and working capital loans, investment loans, people's business loans, syndicated loans, and micro business loans for businesses. The company also provides investment products comprising mutual funds, stocks, and bonds; life, health, and accident insurance products; credit, debit, and corporate cards; digital banking; e-banking services; digital lending; cash management services; trade finance services, value chain, supply chain management, global and domestic trade, export and import, standby letter of credit, and bank guarantee, as well as spot and forex services; custodial services; treasury services, including cash transaction/liquidity, hedging, and investment products; trust services comprising trustee, paying agent, security agent, escrow agent, monitoring agent, and receiving bank services; and money transfer, remittance services, and venture capital financing. It operates branch offices, sub-branch offices, and overseas branch offices; and ATM facilities. The company was founded in 1998 and is headquartered in Jakarta, Indonesia."
  },
  "BNGA.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank CIMB Niaga Tbk, together with its subsidiaries, provides various banking products and services in Indonesia and internationally. It offers saving, current, and time deposit products; credit and debit cards; mortgages and loans; distributor and supplier financing services; treasury products, such as foreign exchange, strike currency, market-linked deposits, swap deposit, bonds, hedging instruments, investment, and foreign currency, as well as mutual fund products; general and life bancassurance products; digital and mobile banking services. The company also provides working capital, commercial property, investment, and supply chain financing services; and remittances, factoring, custodian, and fund services, as well as wealth management services. In addition, it offers letter of credit, export notes negotiation and discount, outward and inward documentary collections, pre-shipment financing, domestic letter of credit, trust receipt, non-cash loan financing facility, cash management, bank and shipping guarantee, standby letter of credit and demand guarantee, trade account payable special transaction loans, and trade account receivable special transaction loans. Further, the company operates automatic teller machines. The company was formerly known as PT Bank Niaga Tbk and changed its name to PT Bank CIMB Niaga Tbk in May 2008. The company was founded in 1955 and is headquartered in Jakarta, Indonesia. PT Bank CIMB Niaga Tbk is a subsidiary of CIMB Group Sdn. Bhd."
  },
  "BNII.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Maybank Indonesia Tbk provides general banking services in Indonesia and internationally. The company operates through Global Banking, Business Banking, and Retail segments. It provides savings and current accounts, and demand and time deposits; credit cards; digital banking services; personal, multifunctional, car, and motorcycle loans; mortgages; investment products, such as government bonds and mutual funds; and various insurance products. The company also offers working capital solutions; loans for SME; commercial financing, trade financing, and multi-financing; letters of credit; and investment financing services. In addition, it provides transaction banking services, including liquidity management, and payment and collection services, as well as Shariah banking services. The company was formerly known as PT Bank Internasional Indonesia Tbk and changed its name to PT Bank Maybank Indonesia Tbk. The company was founded in 1959 and is headquartered in Jakarta, Indonesia."
  },
  "BNLI.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Permata Tbk provides various banking products and services to retail, SME, and businesses customers in Indonesia. It offers savings and current accounts, time deposits, mutual funds, bonds, bancassurance, credit cards, and personal and mortgage loans, as well as working capital loans and trade finance. The company also provides cash management services, treasury solutions, supply chain, security and agency services, and capital market products, as well as digital banking services. The company was formerly known as PT Bank Bali Tbk and changed its name to PT Bank Permata Tbk in October 2002. The company was founded in 1954 and is headquartered in Jakarta, Indonesia. PT Bank Permata Tbk is a subsidiary of Bangkok Bank Public Company Limited."
  },
  "BREN.JK": {
    "Industry": "utilities-renewable",
    "Sector": "Utilities",
    "Summary": "PT Barito Renewables Energy Tbk engages in the generation and sale of geothermal power in Indonesia. It also offers management consulting services. The company was founded in 2018 and is based in Jakarta, Indonesia. PT Barito Renewables Energy Tbk operates as a subsidiary of PT Barito Pacific Tbk."
  },
  "BRIS.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Syariah Indonesia Tbk provides various commercial banking products and services in Indonesia. The company operates through Corporate Banking, Commercial Banking, Institutional Relation, Retail, and Treasury Banking segments. It offers banking products and services, such as demand deposits, savings, and time deposits; micro financing; working capital and investment financing; and internet banking services. The company also provides movable or immovable goods purchase finance leasing services; debit and financing cards; buying, selling, and guaranteeing third party securities; and trustee, custodian, buyer and supplier financing, distributor financing, and bank guarantee services; and refinancing, multi financing, and sharia current account financing services. PT Bank Syariah Indonesia Tbk was founded in 1969 and is headquartered in South Jakarta, Indonesia. PT Bank Syariah Indonesia Tbk operates as a subsidiary of PT Bank Mandiri (Persero) Tbk."
  },
  "BSDE.JK": {
    "Industry": "real-estate-development",
    "Sector": "Real Estate",
    "Summary": "PT Bumi Serpong Damai Tbk, together with its subsidiaries, engages in the real estate development activities in Indonesia. It operates through Real Estate, Property, Hotel, Toll Road, and Others segments. The company is developing the BSD City, a planned and integrated residential area with amenities/infrastructure, environmental facilities, and parks. It is also involved in the hotel operations; leasing of office space; concession of toll road projects; and investment and transportation activities. In addition, the company engages in the development of apartments and shopping centers; and provision of other financial services. PT Bumi Serpong Damai Tbk was founded in 1984 and is headquartered in Tangerang, Indonesia."
  },
  "BTPN.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank BTPN Tbk provides various banking products and services primarily in Indonesia. It operates through five segments: Retail; Micro, Small & Medium Enterprises; Funding and Treasury; Corporate; and Sharia. The company offers savings and current accounts; demand and time deposits; term installment, employee, maxi micro, digital micro, term, working capital and investment, and syndication loans; business credit, overdraft facility, project finance, and long term financing, as well as Kredit Lintas Manfaat; and transaction banking comprising remittance, tax payment, trade, and cash management. It also provides bancassurance and investment products, such as mutual funds and government bonds, as well as life, and death and critical illness insurance; and treasury products, including foreign exchange and derivatives. It operates branches, subbranches, and ATMs and TCRs. The company was founded in 1958 and is headquartered in Jakarta, Indonesia. PT Bank BTPN Tbk operates as a subsidiary of Sumitomo Mitsui Banking Corporation."
  },
  "BTPS.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank BTPN Syariah Tbk, together with its subsidiaries, provides various banking products and services in Indonesia. The company offers current, time, and savings deposits; and capital, investment, and sharia financing, as well as funding, bill payment, fund transfer, cash deposit, and cash withdrawal services. It also provides venture funds management, internet and mobile banking, and ATM services. The company was formerly known as PT Bank Tabungan Pensiunan Nasional Syariah Tbk and changed its name to PT Bank BTPN Syariah Tbk in May 2020. The company was founded in 1991 and is headquartered in Jakarta Selatan, Indonesia. PT Bank BTPN Syariah Tbk operates as a subsidiary of PT Bank BTPN Tbk."
  },
  "BWPT.JK": {
    "Industry": "farm-products",
    "Sector": "Consumer Defensive",
    "Summary": "PT Eagle High Plantations Tbk, together with its subsidiaries, engages in the oil palm industry and plantations in Indonesia and Singapore. It operates through two segments, Plantations and Manufacturing. The company operates oil palm plantations in Kalimantan, Sumatra and Papua; and palm oil processing mills in Kalimantan and Papua. It also offers palm products, such as crude palm oil and palm kernel. PT Eagle High Plantations Tbk was founded in 2000 and is based in Jakarta, Indonesia."
  },
  "BYAN.JK": {
    "Industry": "thermal-coal",
    "Sector": "Energy",
    "Summary": "PT Bayan Resources Tbk., together with its subsidiaries, engages in the coal mining and sale in Indonesia. It operates through Coal and Non-Coal segments. The company produces high calorific value coal, sub-bituminous low-sulphur, bituminous, low-ash coal, and other products. It is also involved in the provision of mining contractor, coal transshipment and other port, power supply, and trading services. PT Bayan Resources Tbk. was founded in 1973 and is headquartered in Jakarta, Indonesia."
  },
  "CARS.JK": {
    "Industry": "auto-truck-dealerships",
    "Sector": "Consumer Cyclical",
    "Summary": "PT Industri dan Perdagangan Bintraco Dharma Tbk, together with its subsidiaries, engages in the automotive business in Indonesia. It operates through Financing, Automotive, and Aftersales segments. The company sells motor vehicles; and offers sales and after-sales services, as well as provides automotive financing services. It is also involved in the trade and distribution of car and motorcycle equipment, spare parts, and services; operates automotive workshops under the BENGKEL CARFix brand name; provision of vehicle repair services; building rental activities; and vehicle dealing business. In addition, the company operates a car e-commerce service platform. PT Industri dan Perdagangan Bintraco Dharma Tbk was incorporated in 1969 and is based in Tangerang Selatan, Indonesia."
  },
  "CEKA.JK": {
    "Industry": "packaged-foods",
    "Sector": "Consumer Defensive",
    "Summary": "PT Wilmar Cahaya Indonesia Tbk. engages in the production and sale of vegetable and specialty oils for the food industry primarily in Indonesia. The company offers crude palm oil and its derivatives, and illipe nuts and oils; specialty fats, including cocoa butter substitutes, cocoa butter replacers, cocoa butter equivalents, confectionary fats, icing and filling fats, milk fat replacers, ice cream fats, and spread fats; bakery fats comprising margarine products, butter oil substitutes, frying and superfry shortening, and fats; and cooking oil. It also engages in general trading comprising import and export; and trading of agricultural products, forest products, and daily need goods, as well as operates as a wholesaler, distributor, supplier, retailer, and others. The company was formerly known as PT Cahaya Kalbar Tbk. and changed its name to PT Wilmar Cahaya Indonesia Tbk. in May 2013. The company was founded in 1968 and is headquartered in Bekasi, Indonesia. PT Wilmar Cahaya Indonesia Tbk. operates as a subsidiary of PT Sentratama Niaga Indonesia."
  },
  "CFIN.JK": {
    "Industry": "credit-services",
    "Sector": "Financial Services",
    "Summary": "PT. Clipan Finance Indonesia Tbk engages in the financial leasing, consumer financing, factoring, and sale and leaseback business in Indonesia. It offers new and used car financing; cash financing for wedding, house renovation, tours, worship trips, education, and other consumption needs; fleet financing; and heavy equipment financing for mining, industry, plantations, forestry, barges, tugboats, and production machinery. PT. Clipan Finance Indonesia Tbk was founded in 1982 and is headquartered in Jakarta, Indonesia. PT. Clipan Finance Indonesia Tbk operates as a subsidiary of P.T. Bank Pan Indonesia Tbk."
  },
  "CMRY.JK": {
    "Industry": "packaged-foods",
    "Sector": "Consumer Defensive",
    "Summary": "PT Cisarua Mountain Dairy Tbk produces and sells dairy and consumer products in Indonesia. The company offers milk, yogurt, sausages, meatballs, nuggets, and seafood products, as well as egg-based products primarily under the Cimory, Kanzler, and Besto brands. It also engages in the wholesale and retail trading, and transportation and warehousing business. The company was founded in 1993 and is based in Jakarta, Indonesia."
  },
  "CNMA.JK": {
    "Industry": "entertainment",
    "Sector": "Communication Services",
    "Summary": "PT Nusantara Sejahtera Raya Tbk engages in the movie screening and restaurant business in Indonesia. It also offers land leasing services and online ticketing platform. The company was founded in 1988 and is headquartered in Central Jakarta, Indonesia."
  },
  "CPIN.JK": {
    "Industry": "farm-products",
    "Sector": "Consumer Defensive",
    "Summary": "PT Charoen Pokphand Indonesia Tbk produces and sells poultry feed, processed chicken, and day old chicks (DOC) in Indonesia. The company offers broiler and layer poultry feed; and various poultry feed products under the brands of HI-PRO, HI-PRO-VITE, BINTANG, BONAVITE, ROYAL FEED, TURBO FEED, and TIJI. It also provides various types of DOC, such as broiler DOC, layer DOC, and other DOC. In addition, the company sells processed chicken products, such as karage, nugget, spicy wing, sausage, and others under the GOLDEN FIESTA, FIESTA, CHAMP, AND OKEY brands. Further, it is involved in poultry farming and beverage activities; trading of raw material, processed food, and medicine; the production of plastic packaging products; the production and distribution of raw material for feed; and the operation of restaurants and convenience stores. The company was formerly known as PT Charoen Pokphand Indonesia Animal Feedmill Co. Limited. PT Charoen Pokphand Indonesia Tbk was founded in 1972 and is headquartered in Jakarta, Indonesia. PT Charoen Pokphand Indonesia Tbk is a subsidiary of PT Charoen Pokphand Indonesia Group."
  },
  "DMAS.JK": {
    "Industry": "real-estate-development",
    "Sector": "Real Estate",
    "Summary": "PT Puradelta Lestari Tbk, together with its subsidiary, engages in the development, management, operation, lease, and sale of residential, commercial, industrial real estate properties in Indonesia. The company operates through Property, Hotel, and Others segments. Its portfolio includes Kota Deltamas, an independent city consisting of residential properties; commercial properties, such as shophouses; and industrial properties, including water and wastewater treatment plants, power and gas supply for industry activities, and factory buildings. The company was incorporated in 1993 and is headquartered in West Jakarta, Indonesia. PT Puradelta Lestari Tbk operates as a subsidiary of PT Sumber Arusmulia."
  },
  "DNAR.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Oke Indonesia Tbk provides various banking products and services in Indonesia. The company offers current and saving accounts, demand, and time deposits, as well as certificates of deposit; and offers current account loans, working capital, investment, lines of credit, and consumer loans, such as mortgages and vehicle loans, as well as unsecured credit and payroll loans. It also provides transfer of funds through RTGS and SKN; and ATM/debit, telephone payment, foreign exchange trading, safe deposit box leasing, and bank guarantee services, as well as internet/mobile banking services. The company was founded in 1990 and is headquartered in Central Jakarta, Indonesia. PT Bank Oke Indonesia Tbk operates as a subsidiary of OK Next Co,. Ltd."
  },
  "DOID.JK": {
    "Industry": "thermal-coal",
    "Sector": "Energy",
    "Summary": "PT Delta Dunia Makmur Tbk, through its subsidiaries, operates as a coal mining contractor in Indonesia and Australia. The company provides mine planning and survey, coal mining, overburden removal, coal hauling, reclamation, and land rehabilitation services, as well as road maintenance services. It also engages in the rental of heavy equipment. The company was founded in 1990 and is headquartered in Jakarta, Indonesia."
  },
  "DRMA.JK": {
    "Industry": "auto-parts",
    "Sector": "Consumer Cyclical",
    "Summary": "PT Dharma Polimetal Tbk, through its subsidiaries, manufactures and sells automotive components for motorcycles and cars in Indonesia. The company offers metal-based, plastic injection, and cable control automotive components, as well as wiring harness, and various battery products. Its products portfolio includes grabrailm swing arm, frame body, side stand, main stand, steering handle, and muffler; powerace boxes, powerace max, and powerace new assy EV; suspension member, windshield header, steering hanger beam, insulator exhaust, hood lock, member apron, axle torsion beam, body lower, and back inner and outer; and fasteners and bicycles. The company's products also comprise main harness, USB charging, sub harness battery, and speedometer harness; reverse parking sensor, engine hood security alarm, rear seat entertainment, back and corner sensor, and head unit; double seat, cover and fender front, and protector muffler; cover radiator grill, front and rear bumper side; and electrical, accessories, and engine parts. It also provides throttle, speedometer, front break, backdoor, fuel lid, and hood lock cable; precision parts; carbide cutting tools, inspection jigs, special purpose machine, ventilator, diamond cutting tools, dies, universal robot, and single parts; and converter and frame sub assy, pipe exhaust tile, and door sash comp, as well as tail gate, door and floor harness. PT Dharma Polimetal Tbk was founded in 1989 and is headquartered in Cikarang, Indonesia."
  },
  "DSNG.JK": {
    "Industry": "farm-products",
    "Sector": "Consumer Defensive",
    "Summary": "PT Dharma Satya Nusantara Tbk operates in the palm oil and wood product business in Indonesia. It operates through three segments: Crude Palm Oil, Wood Products, and Others. The company plants, produces, and sells palm oil products, including crude palm oil, palm kernel, and palm kernel oil. It also provides various wood products, such as panels and engineered floors; and produces compressed natural gas from palm oil mill effluent and biomass. It also exports its products. PT Dharma Satya Nusantara Tbk was founded in 1980 and is headquartered in Jakarta, Indonesia."
  },
  "DVLA.JK": {
    "Industry": "drug-manufacturers-specialty-generic",
    "Sector": "Healthcare",
    "Summary": "PT Darya-Varia Laboratoria Tbk engages in the manufacture and trading of pharmaceutical products and cosmetics in Indonesia. It operates in three segments: Prescription Drugs, Consumer Health Products, and Export and Toll Manufacturing Services. The company provides various prescription and consumer health products in antibiotic, antiparasit, antiseptic, anti-fungal, analgesics, cough and cold, cardiology, central nervous system, gastro-hepatology, somatic, vitamin and food supplement, women healthcare, ear healthcare, and derma medic areas, as well as offers skin nutrition and daily relief products. It also exports its products to Malaysia, Myanmar, the Philippines, Singapore, Vietnam, and Mongolia. The company was founded in 1976 and is headquartered in Jakarta, Indonesia. PT Darya-Varia Laboratoria Tbk is a subsidiary of Blue Sphere Singapore Pte. Ltd."
  },
  "ELSA.JK": {
    "Industry": "oil-gas-equipment-services",
    "Sector": "Energy",
    "Summary": "PT Elnusa Tbk provides oil and gas services in Indonesia. The company operates through Integrated Upstream Oil and Gas Services; Oil and Gas Support Services; and Energy Distribution and Logistics Services segments. It offers geophysical/seismic data, oil and gas drilling, and oilfield services; and threading for oil and gas drilling, oil and gas data management, integrated information technology development, telecommunication, network, storage, and satellite communication services. The company also provides data and information on energy and mineral resources management services; very-small-aperture terminal-based communication systems; open cycle gas turbine pipe manufacturing and trading services; and trading, distribution, and marketing of oil and gas products. In addition, it offers physical data and general warehousing, core service, and remote storage services; data remastering services; solutions for formatting data, water treatment plants and smart water meters; fleet management, and logistic and supply chain services; IT and communication services; and IOT products and services, including LORA devices and network infrastructure, and tracking monitoring and network management systems. Further, the company distributes and trades in oil and chemicals; operates retail gas stations; and offers mechanical maintenance, and ship rental and agent services. The company was formerly known as PT Electronika Nusantara and changed its name to PT Elnusa Tbk in June 1984. PT Elnusa Tbk was founded in 1969 and is based in Jakarta, Indonesia. PT Elnusa Tbk is a subsidiary of PT Pertamina Hulu Energi."
  },
  "ESSA.JK": {
    "Industry": "oil-gas-refining-marketing",
    "Sector": "Energy",
    "Summary": "PT ESSA Industries Indonesia Tbk., together with its subsidiaries, operates an ammonia plant in Indonesia. It operates through the Liquefied Petroleum Gas (LPG) Refinery, Ammonia, and Others segments. The company offers ammonia used as a raw material for fertilizer production, explosives, dyes, household cleaners, and nylon. It also provides LPG primarily for use as a kitchen appliance fuel for homes, shopping centers, and hotels; and motor vehicle fuel, as well as for construction industries, such as welding fuel in steel workshops; and condensate for use as a raw material for thinner, adhesive, and vehicle tire applications, as well as light naphtha, which is a cracker material for the manufacture of polyethylene. In addition, the company offers management and business consulting services; and raw feed gas through pipelines. Further, it engages in the procurement and distribution of natural and artificial gas; oil mining; trade of solid, liquid, and gas fuels; and supporting activities of oil and other natural gas mining. The company was formerly known as PT Surya Esa Perkasa Tbk and changed its name to PT ESSA Industries Indonesia Tbk. in October 2023. PT ESSA Industries Indonesia Tbk. was founded in 2006 and is headquartered in Jakarta, Indonesia."
  },
  "EXCL.JK": {
    "Industry": "telecom-services",
    "Sector": "Communication Services",
    "Summary": "PT XL Axiata Tbk, together with its subsidiaries, offers telecommunication, telecommunications network, and multimedia services for consumers and businesses in Indonesia. The company provides cellular mobile and closed fixed network, Internet, Internet telephony and interconnection, data communication system, e-money issuance, switched/packet switched local fixed network, voice over Internet protocol, and money remitter services. It also offers digital content and home broadband services; voice and short message services; cloud and data center services; mobile communication services; and other telecommunication services, includes SIM card sales, leased line, and leased tower. The company was formerly known as PT Excelcomindo Pratama Tbk. and changed its name to PT XL Axiata Tbk in 2009. The company was founded in 1989 and is headquartered in Jakarta Selatan, Indonesia. PT XL Axiata Tbk is a subsidiary of Axiata Investments (Indonesia) Sdn. Bhd."
  },
  "GOOD.JK": {
    "Industry": "packaged-foods",
    "Sector": "Consumer Defensive",
    "Summary": "PT Garudafood Putra Putri Jaya Tbk, together with its subsidiaries, engages in the manufacture and trade of food and beverages in Indonesia and internationally. The company operates through three segments: Packaged Foods, Beverages, and Others. It offers biscuits, shelled peanuts, coated peanuts, pilus and pellet snacks, snacks made from potatoes and corn, chocolates, confectioneries, milk and chocolate drinks, cocoa powders, cheese, and dressing salads. The company also provides atomic peanuts, salted peanuts, sukro peanuts, crunchy peanuts, food made from soybeans and other nuts, ready-to-drink beverages, processed cream from fresh liquid milk, non-alcohol drinks, and herbal products. In addition, it engages in the peanut and corn farming business. The company sells its products under the brands Garuda, Gery, Chocolatos, Clevo, and Prochiz. The company was founded in 1958 and is headquartered in Jakarta Selatan, Indonesia. PT Garudafood Putra Putri Jaya Tbk operates as a subsidiary of PT Tudung Putra Putri Jaya."
  },
  "HMSP.JK": {
    "Industry": "tobacco",
    "Sector": "Consumer Defensive",
    "Summary": "PT Hanjaya Mandala Sampoerna Tbk, together with its subsidiaries, engages in manufacture, distribution, and trading of cigarettes in Indonesia. The company sells its products under the Dji Sam Soe Magnum, Sampoerna Kretek, Sampoerna A, and Marlboro Filter Black brand names. It also engages in the general trading; operation of digital platform for commercial and agency; provision of leisure and golf course services; and property development. The company was founded in 1913 and is headquartered in Surabaya, Indonesia. PT Hanjaya Mandala Sampoerna Tbk operates as a subsidiary of PT Philip Morris Indonesia."
  },
  "HRTA.JK": {
    "Industry": "luxury-goods",
    "Sector": "Consumer Cyclical",
    "Summary": "PT Hartadinata Abadi Tbk manufactures and sells gold jewelry in Indonesia. The company offers necklaces, rings, pendants, earrings, and bracelets. It is also involved in e-commerce and pawnshop activities. The company operates a retail chain of stores under the Aurum Collection Center, Claudia Perfect Jewellery, Celine Jewellery, and Hartadinata Abadi Store names. It distributes its products through wholesalers, retail stores, independent stores, and franchise stores, as well as through online. The company was founded in 1989 and is headquartered in Bandung, Indonesia. PT Hartadinata Abadi Tbk is a subsidiary of PT Terang Anugrah Abadi."
  },
  "ICBP.JK": {
    "Industry": "packaged-foods",
    "Sector": "Consumer Defensive",
    "Summary": "PT Indofood CBP Sukses Makmur Tbk, together with its subsidiaries, produces and sells consumers products in Indonesia, rest of Asia, the Middle East, Africa, and internationally. The company operating through six segments: Noodles Division, Dairy Division (dairy products), Food Seasonings Division, Snack Foods Division, Nutrition and Special Foods Division, and Beverages Division segments. It offers noodles, sauces, and instant seasonings; sweetened condensed milk, liquid milk, powdered milk, ice cream, and butter; chips and non-chips snacks, such as potato biscuits, cassavas, and wheat flour; and food seasonings, including powdered and liquid seasonings, condiments, and syrups. The company also offers nutrition and special foods, such as baby cereals, follow-on cereals, noodle soups, and baby biscuits, as well as fortified milk for expectant and lactating mothers; and beverages comprising ready-to-drink tea, packaged water, and fruit-flavored drinks. In addition, it manufactures packaging materials and non-alcoholic beverages; markets and distributes culinary products; processes oil and fats; manages restaurants; acts as investment and trade export agency; and provides management consulting and industrial estate services. The company was founded in 1982 and is headquartered in Jakarta, Indonesia. PT Indofood CBP Sukses Makmur Tbk is a subsidiary of PT Indofood Sukses Makmur Tbk."
  },
  "IFII.JK": {
    "Industry": "lumber-wood-production",
    "Sector": "Basic Materials",
    "Summary": "PT Indonesia Fibreboard Industry Tbk manufactures and sells wood products in Indonesia, Japan, the Middle East, and internationally. It offers high, medium, and low density fiberboards; high moisture resistance wood products; plywood and plywood medium density fiberboard (MDF) products; MDF laminate paper; and veneer wood products. The company was founded in 2007 and is headquartered in Jakarta Utara, Indonesia. PT Indonesia Fibreboard Industry Tbk is a subsidiary of PT Adrindo Intiperkasa."
  },
  "IGAR.JK": {
    "Industry": "packaging-containers",
    "Sector": "Consumer Cyclical",
    "Summary": "PT Champion Pacific Indonesia Tbk, together with its subsidiaries, engages in manufacture, supply, and sale of flexible packaging products in Indonesia. It offers various plastic products for the pharmaceutical, food, cosmetics, agrochemical, and other industries. The company was formerly known as PT Kageo Igar Jaya Tbk and changed its name to PT Champion Pacific Indonesia Tbk in October 2010. PT Champion Pacific Indonesia Tbk was founded in 1975 and is headquartered in Bekasi, Indonesia. PT Champion Pacific Indonesia Tbk is a subsidiary of PT Kingsford Holdings."
  },
  "INCO.JK": {
    "Industry": "other-industrial-metals-mining",
    "Sector": "Basic Materials",
    "Summary": "PT Vale Indonesia Tbk engages in the mining and processing of nickel in Indonesia. It operates a concession area of 118,017 hectares located in central, south, and southeast Sulawesi. The company was formerly known as PT International Nickel Indonesia Tbk and changed its name to PT Vale Indonesia Tbk in September 2011. The company was incorporated in 1968 and is headquartered in Jakarta, Indonesia."
  },
  "INDF.JK": {
    "Industry": "packaged-foods",
    "Sector": "Consumer Defensive",
    "Summary": "PT Indofood Sukses Makmur Tbk operates as a food solutions company in Indonesia, the Middle East, Africa, rest of Asia, internationally. It operates through Consumer Branded Products Business Group, Bogasari Business Group, Agribusiness Group, and Distribution Business Group segments. It offers noodles; ultra-high temperature (UHT), sterilized bottled, evaporated, pasteurized liquid, UHT multi-cereal, and powdered milk; milk-flavored and cereal powdered drinks, sweetened condensed creamer, ice cream, and butter; potato, cassava, soybean, corn, and various extruded snacks; recipe mixes, soy and chili sauce, tomato sauce, and stock soup; baby cereals; rice puffs, crunchies, biscuits, puddings, noodle soup, and pasta; cereal snacks for children; and ready-to-drink tea, packaged water, and fruit-flavored drinks. It also produces wheat flour, pasta, and coffee; distributes consumer products; manufactures and markets cooking oils, margarine, and shortening; cultivates sugar cane, rubber, industrial timber, cocoa, coconut, tea plantations, and other crops; extracts and processes coconut oil; operates bulking station; processes oils and fat; markets and distributes culinary products; engages in the research and development, seed breeding, and oil palm cultivation and milling activities; shipping, investment and management, trade export agency, industrial estate agriculture, forestry, fishing, and trading and marketing activities; ownership and management of buildings; chain restaurant management; flour milling, blending, and trading; and provision of transportation, management consulting, and research management and technical services, as well as packaging materials and fertilizers. The company was formerly known as PT Panganjaya Intikusuma and changed its name to PT Indofood Sukses Makmur Tbk in 1994. The company was incorporated in 1990 and is headquartered in Jakarta, Indonesia. PT Indofood Sukses Makmur Tbk is a subsidiary of First Pacific Investment Management Limited."
  },
  "INDR.JK": {
    "Industry": "textile-manufacturing",
    "Sector": "Consumer Cyclical",
    "Summary": "PT. Indo-Rama Synthetics Tbk, together with its subsidiaries, engages in the production, export, and sale of polyester, spun yarns, and fabrics. It operates through Spun Yarns, Polyester, Fabrics, and Others segments. It offers spun yarns, sewing threads, polyester filament yarns, polyester staple fiber, chips, pet resins, grey and finished polyester fabrics, nitrogen and phosphate fertilizers, polyethylene, polypropylene, polyester, textiles, cotton fiber, and medical gloves. The company is also involved in the trading, investment, and other activities; and office and school buildings management. It has operations in Indonesia, rest of Asia, Europe, North America, South America, and internationally. The company was incorporated in 1975 and is headquartered in Jakarta, Indonesia. PT. Indo-Rama Synthetics Tbk operates as a subsidiary of Indorama Holdings B.V."
  },
  "INTP.JK": {
    "Industry": "building-materials",
    "Sector": "Basic Materials",
    "Summary": "PT Indocement Tunggal Prakarsa Tbk manufactures and sells cement and ready-mix concrete products in Indonesia and internationally. It operates through three segments: Cement, Ready-Mix Concrete, and Aggregates Quarries. The company offers Portland composite; Portland type I, II, and V; oil well; white; and TR30 white mortar cement products, as well as multipurpose mortar, thinbed, and plester plus under the Tiga Roda, Rajawali, Duracem, and Semen Jempolan brands. It is also involved in the aggregate and trass quarrying, shipping, port management, construction, outsourcing, and trading activities; and provides clay and limestone products. PT Indocement Tunggal Prakarsa Tbk founded in 1975 and is headquartered in Jakarta, Indonesia. PT Indocement Tunggal Prakarsa Tbk is a subsidiary of Birchwood Omnia Limited."
  },
  "ISAT.JK": {
    "Industry": "telecom-services",
    "Sector": "Communication Services",
    "Summary": "PT Indosat Ooredoo Hutchison Tbk, together with its subsidiaries, provides telecommunication services in Indonesia. It operates in three segments: Cellular; Multimedia, Data Communication, Internet; and Fixed Telecommunications. The company offers prepaid and post-paid services, and international and roaming, such as outbound roamers, international call and SMS, and overseas call products. It also provides ancillary goods and promotional merchandise; data communication and IT services; and electronic payment and remittance services. In addition, the company operates an online store. It offers services under the Ooredoo brand name. The company was founded in 1967 and is headquartered in Jakarta, Indonesia. PT Indosat Ooredoo Hutchison Tbk operates as a subsidiary of Ooredoo Hutchison Asia Pte. Ltd."
  },
  "ISSP.JK": {
    "Industry": "steel",
    "Sector": "Basic Materials",
    "Summary": "PT Steel Pipe Industry of Indonesia Tbk, together with its subsidiaries, engages in the manufacture and sale of steel pipes and other related products in Indonesia. It operates through Steel Pipe Mill; Spiral Steel Pipe Mill; Strips and Plate; and Services and Others segments. The company provides ERW and SSAW structural, water, and oil and gas pipes used in bridge, construction, transmission water pipelines, water and wastewater treatment plants, hydropower use facilities, building water circulation systems, water tunnels, and structural applications, as well as in oil and gas industry. It also offers stainless steel pipes, including ornamental tubes and industrial pipes; galvanized and galvanized iron pipes applied as ceiling / ceiling frames, wall partition frames, canopies, fences, gates, electrical, and telecommunication cable channels; steel poles comprising telephone, electric, and lighting poles; and mechanical tubes for use in furniture materials, bus frame structures, bicycle frames, and automotive parts, as well as various services. The company was incorporated in 1971 and is headquartered in Surabaya, Indonesia. PT Steel Pipe Industry of Indonesia Tbk operates as a subsidiary of PT Cakra Bhakti Para Putra."
  },
  "ITMG.JK": {
    "Industry": "thermal-coal",
    "Sector": "Energy",
    "Summary": "PT Indo Tambangraya Megah Tbk, together with its subsidiaries, engages in coal mining activities. The company operates mining concessions in the island of Kalimantan covering East, Central, and South Kalimantan. It also owns and operates the Bontang Coal Terminal, loading ports, and Bontang power plant. In addition, the company provides mining support, coal and fuel trading, fuel distribution, coal transportation, and alternative energy trading services, as well as engages in renewable power generation activities. It primarily sells its coal in Indonesia, India, Pakistan, Taiwan, China, Hong Kong, Korea, Japan, Europe, and other countries. The company was founded in 1987 and is headquartered in South Jakarta, Indonesia. PT Indo Tambangraya Megah Tbk operates as a subsidiary of Banpu Minerals (Singapore) Pte. Ltd."
  },
  "JKON.JK": {
    "Industry": "conglomerates",
    "Sector": "Industrials",
    "Summary": "PT Jaya Konstruksi Manggala Pratama Tbk engages in the construction business in Indonesia. The company is also involved in asphalt and liquefied petroleum gas trading; LPG and bulk transportation; chartering of vessels; supply of electricity, gas, and steam; transportation, warehousing, professional, scientific, and engineering activities; building, services, and industry activities; provision of contractor and services; and general trading, manufacturing, and workshop and industry activities. In addition, it engages in the production and trading of building goods; production of prestressed concrete piles, directing of concrete piles, and design and planning of pile foundations, as well as carrying out and analyzing load bearing tests. Further, the company owns or leases real estate properties; and trades in materials and chemical goods. The company was founded in 1982 and is based in Jakarta, Indonesia. PT Jaya Konstruksi Manggala Pratama Tbk is a subsidiary of PT Pembangunan Jaya."
  },
  "JPFA.JK": {
    "Industry": "farm-products",
    "Sector": "Consumer Defensive",
    "Summary": "PT Japfa Comfeed Indonesia Tbk operates as an agri-food company. The company operates through six segments: Animal Feed, Poultry Breeding, Commercial Farm, Poultry Processing and Consumer Products, Aquaculture, and Trading and Others. It provides poultry feed, day old chick broilers/layers and pullets, commercial live broiles; veterinary medicines; and feed for fresh water and marine fishes, shrimps and eels, as well as produces chicken meat and chicken based processed products. The company also operates cold storage and planting, as well as fish farming, and shrimp farming and hatcheries. In addition, it engages in commercial farming, and beef cattle breeding, fattening, and slaughterhouse activities. Further, the company provides woven plastic bags, copra pelletizing, animal vaccines, freight, animal health, and livestock equipment, as well as operates retail meat store. Additionally, it is involved in the real estate, plantation, transportation management, and investment activities, as well as agricultural machinery and equipment supplies. The company markets its products in Indonesia, Asia, Europe, and the United States. The company was founded in 1971 and is headquartered in Jakarta, Indonesia. PT Japfa Comfeed Indonesia Tbk is a subsidiary of Japfa Ltd."
  },
  "JRPT.JK": {
    "Industry": "real-estate-development",
    "Sector": "Real Estate",
    "Summary": "PT Jaya Real Property, Tbk., together with its subsidiaries, operates as a property development, management, and investment company in Indonesia. The company operates through Sale of Land and Buildings, and Rental and Other Services segments. The Sale of Land and Buildings segment engages in the real estate and urban development activities; and release/purchase, processing, maturation, and development of facilities and infrastructure, as well as entertainment segment, such as icerink, water park, sports club, driving range, and oceanarium. The Rental and Other Services segment is involved in leasing of shopping centers, hotels, icerink, water parks, areas of the city, and water management business. The company provides general trading and construction, building management, and transportation services, as well as operates hotels. The company was founded in 1979 and is based in Tangerang, Indonesia. PT Jaya Real Property, Tbk. is a subsidiary of PT Pembangunan Jaya Ancol Tbk."
  },
  "JSMR.JK": {
    "Industry": "infrastructure-operations",
    "Sector": "Industrials",
    "Summary": "PT Jasa Marga (Persero) Tbk develops, constructs, operates, manages, and maintains toll roads in Indonesia. The company offers road construction and maintenance services. It also rents toll road equipment and vehicles; holds toll road concessions, as well as develops and constructs real estate properties, including residential, office building, and apartment; and manages rest areas. The company operates 9 toll roads. PT Jasa Marga (Persero) Tbk was founded in 1978 and is headquartered in Jakarta, Indonesia."
  },
  "LINK.JK": {
    "Industry": "telecom-services",
    "Sector": "Communication Services",
    "Summary": "PT Link Net Tbk distributes television programmes and high-speed internet through its broadband communication network in Indonesia. The company offers broadband internet connections and cable TV for residential customers; and connectivity and integrated communications technology solutions, as well as sales of advertising time or slots, IT managed services, and sale of equipment for enterprise customers. It also provides broadband services; subscription broadcasting and outsourcing; and communication system, network access point, multimedia, telephony value added, and telephony internet services for public purposes, as well as trading, management consultancy, and call center services. It serves customers in the Jakarta, Bogor, Depok, Tangerang, Bekasi, Surabaya, Bali, Bandung, Medan, Batam, Solo, Semarang, Cikampek-Purwakarta, Cirebon, Tegal, Yogyakarta, Sukabumi, Purwokerto, Serang, and Kediri areas of Indonesia. The company was formerly known as PT Seruling Indah Permai and changed its name to PT Link Net Tbk in March 2000. PT Link Net Tbk was founded in 1996 and is headquartered in Jakarta, Indonesia."
  },
  "LPCK.JK": {
    "Industry": "real-estate-development",
    "Sector": "Real Estate",
    "Summary": "PT Lippo Cikarang Tbk, together with its subsidiaries, engages in the development of real estate and industrial estate projects in Indonesia. It also engages in construction, purchase, sale, lease, and operation of exhibition spaces, storage facilities, private buildings, malls, shopping centers, hospitals, conference halls, houses of worship, hotels, sports centers, golf courses, clubs, restaurants, entertainment venues, medical, laboratories, pharmacies, office buildings, parking lots, and other supporting facilities. In addition, the company offers water and waste water management services; trading; and transportation, waste management, and recycling services, as well as estate management services. Further, it is involved in the professional, scientific, and technical activities; and remediation, employment activities, and other business activities. The company was founded in 1987 and is headquartered in Bekasi, Indonesia. PT Lippo Cikarang Tbk is a subsidiary of PT Kemuning Satiatama."
  },
  "LPKR.JK": {
    "Industry": "real-estate-services",
    "Sector": "Real Estate",
    "Summary": "PT Lippo Karawaci Tbk, together with its subsidiaries, provides property development services in Indonesia. The company operates through Holdco, Real Estate Development, Healthcare, and Lifestyle segments. It is also involved in the real estate activities, including urban development; development of facilities and its infrastructure; large scale integrated and infrastructure development projects; and other investments, as well as offers health services. In addition, the company develops and manages shopping center; operates hotels, recreation centers, and restaurants; provides health, town management, and water and sewage treatment services; offers transportation and maintenance services; and provides management services. Further, it offers professional, scientific, and technical services; trading, water management, wastewater management, waste management and recycling, parking, remediation, employment, social activities, and other supporting services, as well as hospital, clinic, health center, polyclinic, and other related services. Additionally, the company engages in investment, development, printing, agriculture, gardening, workshop, mining, computer programming, and other management consulting related services. Furthermore, it provides hotel management, township development, asset management, and home care activities. The company was formerly known as PT Tunggal Reksakencana. PT Lippo Karawaci Tbk was founded in 1990 and is based in Tangerang, Indonesia."
  },
  "LPPF.JK": {
    "Industry": "department-stores",
    "Sector": "Consumer Cyclical",
    "Summary": "PT Matahari Department Store Tbk, together with its subsidiaries, engages in the retail business in Indonesia. The company offers apparel, accessories, bags, shoes, and cosmetics for women, men, and children under NEVADA, COLE, CONNEXION, Little M, Details, Pipiniko, St. Yves, and Suko brand names. It also provides household appliances and management consulting services. The company serves its products through physical stores, the Matahari application, and Shop & Talk. PT Matahari Department Store Tbk was founded in 1958 and is headquartered in Tangerang, Indonesia."
  },
  "LSIP.JK": {
    "Industry": "farm-products",
    "Sector": "Consumer Defensive",
    "Summary": "PT Perusahaan Perkebunan London Sumatra Indonesia Tbk, together with its subsidiaries, engages in the plantation business in Indonesia and internationally. The company operates in four segments: Oil Palm Products, Rubber, Seeds, and Others. It offers crude palm oil, palm kernel oil, rubber, cocoa, tea, and oil palm seeds. The company also operates palm oil mills, crumb rubber processing facilities, sheet rubber processing facilities, cocoa factories, and tea factories. In addition, it engages in research, processing, trading, marketing, industrial, and agency/representative activities; and invests in agricultural technology and cultivation, as well as agriculture, forestry, and fishery businesses. The company was founded in 1906 and is based in South Jakarta, Indonesia. PT Perusahaan Perkebunan London Sumatra Indonesia Tbk operates as a subsidiary of PT Salim Ivomas Pratama Tbk."
  },
  "LTLS.JK": {
    "Industry": "specialty-chemicals",
    "Sector": "Basic Materials",
    "Summary": "PT Lautan Luas Tbk engages in the manufacture and distribution of basic and specialty chemicals for industrial end-users primarily in Indonesia and the Asia-Pacific region. The company operates through three segments: Distribution, Manufacturing, and Services. It offers sulfuric acid, aluminum sulfate, sodium silicate, potash alum, poly aluminum chloride, glocose, aluminum chlorohydrate, white oil, vaslina, wax, master batch white and additive, PVC stabilizer and compound additives, sodium metabisulphite and sodium bisulphite, blowing agent, fertilizer, and chemical processing for footwear/rubber, paper, water treatment, oilfield and mining, and textile, as well as non-dairy creamer and dairy creamer products. The company also provides laboratory services and solutions for customers in electroplating, leather, paper, textile, and water treatment industries; and supply chain and information technology solutions comprising HR solutions, as well as water treatment solutions through WATERCARE and PUREVE. In addition, it offers integrated logistics services comprising contract and outsourcing logistics, warehouse package and bulk services, bulk product management, stevedoring, cold chain, cold and liquid storage, kitting and co-packaging, freight forwarding, export import expedition, customs brokerage, 3P logistics, and e-fulfilment, as well as cargo, domestics distribution, and transportation services. It serves the food and beverages, animal feed, personal and household care, automotive, drinking and waste water, building construction, agriculture, mining, textile and apparel, as well as pulp, paper, and packaging industries. The company was formerly known as Perusahaan Andil Maskapai Dagang dan Industri Lim Teck Lee and changed its name to PT Lautan Luas Tbk in 1965. The company was founded in 1951 and is headquartered in Jakarta, Indonesia. PT Lautan Luas Tbk is a subsidiary of PT Caturkarsa Megatunggal."
  },
  "MAHA.JK": {
    "Industry": "trucking",
    "Sector": "Industrials",
    "Summary": "PT Mandiri Herindo Adiperkasa Tbk engages in mining support activity for the coal hauling. The company was founded in 1994 and is headquartered in Jakarta, Indonesia."
  },
  "MARK.JK": {
    "Industry": "medical-instruments-supplies",
    "Sector": "Healthcare",
    "Summary": "PT Mark Dynamics Indonesia Tbk manufactures and sells porcelain formers. The company offers examination, surgical, household, custom made, and industrial formers, as well as sanitary wares in the form of toilets, lavatories, bath tubes, yellow and white moulds, tableware, and porcelain clays. It also exports its products. The company was founded in 2002 and is headquartered in Deli Serdang, Indonesia. PT Mark Dynamics Indonesia Tbk is a subsidiary of Tecable (HK) Co. Limited."
  },
  "MCOL.JK": {
    "Industry": "thermal-coal",
    "Sector": "Energy",
    "Summary": "PT Prima Andalan Mandiri Tbk, through its subsidiaries, operates as a coal mining company in Indonesia. The company develops and operates a coal mining project, which covers an area of approximately 9,240 hectares located in Sungai Krassi, Kecamatan Sesayap, and Sembakung of North Kalimanta. It also provides mining contractor, shipping, loading, and unloading services. The company was founded in 1989 and is headquartered in Jakarta, Indonesia. PT Prima Andalan Mandiri Tbk is a subsidiary of PT Edika Agung Mandiri."
  },
  "MCOR.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank China Construction Bank Indonesia Tbk provides various banking products and services in Indonesia. It operates through four segments: Loans, Treasury, Trade Finance, and Unallocated. The company offers rupiah and forex deposito, CCB Indonesia current account, savings, interest rate of time deposit accounts, and time deposits; auto and mortgage loans, and commercial express loans; and safe deposits boxes, and treasury and international banking services. The company was formerly known as PT Bank Windu Kentjana International Tbk and changed its name to PT Bank China Construction Bank Indonesia Tbk in December 2016. The company was founded in 1974 and is headquartered in Jakarta Pusat, Indonesia. PT Bank China Construction Bank Indonesia Tbk operates as a subsidiary of China Construction Bank Corporation."
  },
  "MDKA.JK": {
    "Industry": "other-industrial-metals-mining",
    "Sector": "Basic Materials",
    "Summary": "PT Merdeka Copper Gold Tbk engages in the mining business in Indonesia. It explores for gold, silver, copper, and other related minerals, as well as provides mining services. The company holds interests in the Tujuh Bukit Copper project; Pani Gold project; Tujuh Bukit Gold project; Merdeka Battery Materials project; and Wetar Copper project. It also offers metal manufacturing and trading services; mining and construction services; owns and leases real estate; business consulting and business broker services, as well as engages in other consulting management activities. The company was formerly known as PT Merdeka Sera and changed its name to PT Merdeka Copper Gold Tbk in December 2014. The company was founded in 2012 and is headquartered in Jakarta, Indonesia."
  },
  "MEGA.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Mega Tbk provides various banking products and services in Indonesia. It offers saving accounts, current accounts, and time deposits. The company also provides cash, car, housing, working capital, and investment loans; inventory and supplier financing; financing for the purchase of motor vehicles and assets; credit cards; and various credit facilities. In addition, it offers investment products, such as mutual funds; bancassurance products comprising unit link products; and monitoring agent services for issuance of medium terms notes and guarantor agent services. Further, the company provides treasury products, such as bank note, foreign exchange services, derivatives, and bonds; RTGS, funds remittance, funds transfer, intercity clearing, safe deposit box, custody, trustee, and trade financing services; international banking services; and electronic banking service, including ATM, internet banking, and mobile banking services. The company was formerly known as PT. Karman bank and changed its name to PT Bank Mega Tbk in 1992. The company was founded in 1969 and is headquartered in Jakarta, Indonesia. PT Bank Mega Tbk operates as a subsidiary of PT Mega Corpora."
  },
  "MFIN.JK": {
    "Industry": "credit-services",
    "Sector": "Financial Services",
    "Summary": "PT Mandala Multifinance Tbk engages in the consumer financing activities in Java, Sulawesi, Sumatera, and Kalimantan in Indonesia. It provides motorcycle consumer financing services based on conventional and sharia financing, as well as electronic and furniture, and multipurpose financing services. The company was formerly known as PT Gracia Dinamika Multifinance and changed its name to PT Mandala Multifinance Tbk in March 1997. The company was founded in 1983 and is based in Jakarta Pusat, Indonesia. PT Mandala Multifinance Tbk is a subsidiary of PT Jayamandiri Gemasejati."
  },
  "MORA.JK": {
    "Industry": "telecom-services",
    "Sector": "Communication Services",
    "Summary": "PT Mora Telematika Indonesia Tbk, together with its subsidiaries, operates as a telecommunications infrastructure and network provider in Indonesia and Singapore. It offers connectivity services, including international private leased circuit, domestic leased circuit, and local loop and metro-e services, as well as services for mobile operator in interconnection; internet services, such as IP transit, internet exchange, and net hosting services; and data center services comprising colocation, virtual private server, and cloud storage services, as well as hosting, shared, web and mail services. The company also provides value added solutions, including WiFi, content delivery network, video conference, CCTV security system, mobile VPN, IP PBX, IP TV, system automation, and BTS backhaul services. In addition, it engages in rental link of interconnections. The company serves telecom, ISP/wholesale, government, enterprise, education, oil and gas, media and hospitality, and retail segments. The company was founded in 2000 and is headquartered in Jakarta, Indonesia."
  },
  "MTEL.JK": {
    "Industry": "telecom-services",
    "Sector": "Communication Services",
    "Summary": "PT Dayamitra Telekomunikasi Tbk. provides telecommunication infrastructure solutions. It operates in two segments: Telecommunication Tower Lease and Others. The company engages in telecommunications installation, telecommunications central construction, cable telecommunications, and wireless telecommunications activities. It also offers tower leasing services, which includes macro and small cells, colocations, and resellers, as well as tower solutions. In addition, the company provides project solutions, such as fiber optic, tower, service, mechanical, and electrical solutions; managed services; and digital infra solutions; as well as tower fiberization and edge infrastructure solutions. The company was formerly known as PT Dayamitra Malindo. The company was founded in 1995 and is headquartered in Jakarta, Indonesia. PT Dayamitra Telekomunikasi Tbk. is a subsidiary of PT Telekomunikasi Indonesia (Persero) Tbk."
  },
  "MTMH.JK": {
    "Industry": "medical-care-facilities",
    "Sector": "Healthcare",
    "Summary": "PT Murni Sadar Tbk, together with its subsidiaries, engages in operating private hospitals. The company is headquartered in Medan, Indonesia. PT Murni Sadar Tbk is a subsidiary of PT Sumatera Teknindo."
  },
  "NISP.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank OCBC NISP Tbk provides various banking products and services to corporate and individual customers in Indonesia. The company offers savings and current accounts; time deposits; home, multipurpose, automobile, personal, secured, business, working capital, mortgage, and investment backed loans; credit and debit cards; mutual funds, insurance products, FX products, bonds, and structured and gold products; and premier and private banking services. It also provides payment and collection, trade and supply chain financing, and export and import financing services; payroll and benefit products; treasury products; capital equity; account investment products; and Web and mobile banking, and payment gateway services, as well as e-wallet and bill payment services. In addition, the company offers bank reference, bank comfort, and confirmation letters; safe deposit boxes; telegraphic transfers; and remittance and e-tax services. It operates through a network of multiple offices and ATMs. The company was formerly known as PT Bank NISP Tbk. PT Bank OCBC NISP Tbk was incorporated in 1941 and is headquartered in Jakarta, Indonesia. PT Bank OCBC NISP Tbk operates as a subsidiary of OCBC Overseas Investments Pte. Ltd."
  },
  "NOBU.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Nationalnobu Tbk provides various banking products and services in Indonesia. It operates in Corporate and Treasury segments. The company offers savings account, current account, and time deposit products; and working capital, investment, and consumer loans, such as home mortgage, automobile, and other personal loans. It also provides ATMs; and internet and mobile banking services. The company was formerly known as PT Bank Alfindo. PT Bank Nationalnobu Tbk was founded in 1990 and is headquartered in Kabupaten Tangerang, Indonesia."
  },
  "PANS.JK": {
    "Industry": "capital-markets",
    "Sector": "Financial Services",
    "Summary": "PT Panin Sekuritas Tbk, together with its subsidiaries, engages in the provision of securities brokerage, underwriting, and investment management services in Indonesia. It is also involved in the provision of asset management services, as well as tock, fixed income, margin, and regular and sharia online trading, corporate finance and e-IPO, and reverse REPO. The company was formerly known as PT Nusamas Panin and changed its name to PT Panin Sekuritas Tbk in June 1995. PT Panin Sekuritas Tbk was founded in 1989 and is headquartered in Jakarta Selatan, Indonesia."
  },
  "PBID.JK": {
    "Industry": "packaging-containers",
    "Sector": "Consumer Cyclical",
    "Summary": "PT Panca Budi Idaman Tbk manufactures, distributes, and trades in plastic packaging items. The company operates through Plastic Packaging, Plastic Resins, and Others segments. It provides polyethylene and polypropylene bags; high density polyethylene resins; and heavy-duty sacks, as well as packaging products, such as food wrapping papers, cake boxes, plastic ropes, rubber bands, and straws. The company also sells recycled resins, shrink packaging, woven bags, raffia strings, and rice papers. It distributes its products to retail merchants, semi-wholesalers, and wholesalers. The company provides its products under the Pluit, Tomat, Bangkuang, Jeruk, Cabe, 222, Wayang, Gapura, Sparta, Liberty, Dayana, PB, and various other brand names. It exports its products to the United Kingdom, Germany, the Netherlands, Spain, the United Arab Emirates, Nigeria, the United States, Taiwan, etc. The company was founded in 1979 and is headquartered in Tangerang, Indonesia. PT Panca Budi Idaman Tbk is a subsidiary of PT Alphen Internasional Corporindo."
  },
  "PGAS.JK": {
    "Industry": "utilities-regulated-gas",
    "Sector": "Utilities",
    "Summary": "PT Perusahaan Gas Negara Tbk, together with its subsidiaries, engages in the transmission and distribution of natural gas in Indonesia. It operates through three segments: Gas Trading and Transmission, Exploration and Production of Oil and Gas, and Other Operations. The company is involved in the exploration, exploitation, and business development in oil and gas; and trading and transmission of gas, and processing of liquefied natural gas to industrial, commercial and household customers. It also provides fiber optic rental for network services; construction and maintenance services to the customers; management and leasing services of buildings and equipment; engineering and consultancy services; telecommunications; and electricity services. The company was founded in 1859 and is headquartered in Jakarta, Indonesia. PT Perusahaan Gas Negara Tbk operates as a subsidiary of PT Pertamina (Persero)."
  },
  "PGEO.JK": {
    "Industry": "utilities-renewable",
    "Sector": "Utilities",
    "Summary": "PT Pertamina Geothermal Energy Tbk, together with its subsidiaries, engages in the development of geothermal energy in the upstream and downstream sectors in Indonesia and internationally. The company was founded in 2006 and is headquartered in Central Jakarta, Indonesia. PT Pertamina Geothermal Energy Tbk operates as a subsidiary of PT Pertamina Power Indonesia."
  },
  "PJAA.JK": {
    "Industry": "leisure",
    "Sector": "Consumer Cyclical",
    "Summary": "PT Pembangunan Jaya Ancol Tbk, together with its subsidiaries, manages tourist area, travel show, and lodging areas in Indonesia. It operates through three segments: Tourism, Real Estate, and Trading and Services. The company manages entrance gates, recreational parks and beaches, fantasy world, swimming pool, animal shows, and lodging facilities, as well as engages in merchandise selling activities. It also develops, sells, and rents various real estate properties. In addition, the company is involved in souvenir trading, marine transportation, and restaurant management activities; the purification, management, drainage, supply, and distribution of clean water; and the provision of highway construction and services, and consulting services. The company was founded in 1966 and is headquartered in Jakarta Utara, Indonesia."
  },
  "PNBN.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "P.T. Bank Pan Indonesia Tbk together with its subsidiaries, provides banking products and services for individuals and businesses in Indonesia and internationally. It operates through Banking and Multi-finance segments. The company offers Tabungan Panin, Tabungan Junior, Tabunganku, Tabungan Rencana, Simpanan Pan Dollar, Tabanas Panin, demand, and time deposits. It also provides kredit express panin, overdraft facility and instalment loan, working capital loan, SMART trade finance import and export, SMART trade service, and bank guarantees, micro loans, credit cards, corporate, and syndicate loans; and wealth management, transaction banking, and digital banking services. In addition, the company offers foreign exchange services; and phone, mobile, and internet banking, as well as automated teller machine services. Further, it offers custodial services consisting of handling the settlement of securities transaction, safekeeping and administration of securities, and other related services, such as corporate actions, payments of coupon, dividends, bonus payments, payments of securities at maturity date, and others; and mutual funds, bancassurance products, and bonds, as well as risk profiles. Additionally, the company provides bank drafts, safe deposit boxes, and letters of credit; and export and import, bank draft, collection, domestic and fund transfer, remittance, cash management, and sharia banking and financing services. P.T. Bank Pan Indonesia Tbk was founded in 1971 and is headquartered in Jakarta, Indonesia."
  },
  "PNBS.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Panin Dubai Syariah Tbk operates as a sharia commercial bank for retail, commercial, and corporate customers in Indonesia. It accepts demand, time, current, savings, and other forms of deposits. The company also offers working capital, house financing, investment, multi-service, and other financing services, as well as cash management, guarantees, clearing, real time gross settlement, transfer, ATM, bank reference, and standing order services. It operates through a network of branch offices. The company was formerly known as PT Bank Panin Syariah Tbk and changed its name to PT Bank Panin Dubai Syariah Tbk in July 2016. PT Bank Panin Dubai Syariah Tbk was founded in 1972 and is headquartered in Jakarta, Indonesia. PT Bank Panin Dubai Syariah Tbk operates as a subsidiary of P.T. Bank Pan Indonesia Tbk."
  },
  "PPRE.JK": {
    "Industry": "engineering-construction",
    "Sector": "Industrials",
    "Summary": "PT PP Presisi Tbk operates as an integrated heavy equipment-based construction company in Indonesia. It engages in construction and mining services, structural works, production plants, and heavy equipment rental businesses. The company's civil works projects include the toll road projects, dams, airports, ports, etc. It also provides structural works, including foundation work and formwork services comprising temporary support construction; and ready-mixed concrete and aggregates on a business-to-business and business-to-consumer basis. In addition, the company rents equipment, such as tower cranes, passenger hoists, crawler cranes, generator sets, and formwork scaffolding, as well as concrete pumps. The company was formerly known as PT PP Peralatan Konstruksi and changed its name to PT PP Presisi Tbk in March 2017. PT PP Presisi Tbk was incorporated in 2004 and is headquartered in Jakarta, Indonesia. PT PP Presisi Tbk is a subsidiary of PT Pembangunan Perumahan (Persero) Tbk."
  },
  "PRDA.JK": {
    "Industry": "diagnostics-research",
    "Sector": "Healthcare",
    "Summary": "PT Prodia Widyahusada Tbk provides clinical laboratory services primarily in Indonesia. The company offers laboratory, genomic, non-laboratory, and panel test services. It also operates Prodia health care and specialty clinics; and offers vaccination services. The company was founded in 1973 and is headquartered in Jakarta Pusat, Indonesia. PT Prodia Widyahusada Tbk operates as a subsidiary of PT Prodia Utama."
  },
  "PTBA.JK": {
    "Industry": "thermal-coal",
    "Sector": "Energy",
    "Summary": "PT Bukit Asam Tbk, together with its subsidiaries, engages in the coal mining activities in Indonesia. Its coal mining activities include general surveying, exploration, exploitation, processing, refining, transportation, and trading. It maintains special coal port facilities; operates steam power plants; and engages in the mining of coal methane gas. The company also offers briquette processing, mining services, palm plantation and processing, and health services, as well as real estate and construction services. In addition, it engages in cruise; hospital clinic, and polyclinic; rental; port; and trade, services, workshop, development, industry, and transportation businesses. It also operates in India, South Korea, China, Japan, Italy, Thailand, Cambodia, Taiwan, Malaysia, the Philippines, Vietnam, and Hong Kong. The company was formerly known as PT Bukit Asam Persero Tbk and changed its name to PT Bukit Asam Tbk in November 2017. PT Bukit Asam Tbk was founded in 1919 and is based in Tanjung Enim Selatan, Indonesia. PT Bukit Asam Tbk operates as a subsidiary of PT Indonesia Asahan Aluminium (Persero)."
  },
  "PTPP.JK": {
    "Industry": "engineering-construction",
    "Sector": "Industrials",
    "Summary": "PT PP (Persero) Tbk operates as a construction and investment company in Indonesia. The company provides civil works, such as drainage and irrigation networks; underwater buildings; weirs, dams, and tunnels; clean water; roads, runway bridges, and ground drilling locations; road and railroad bridges; MRT; jetties or ports, wave, and ground barriers; airports; piping; ground transportation stations; constructs telecommunications building facilities; and other civil buildings. It also offers reclamation and dredging, rice field printing and land clearing, electricity support, landscaping, drilling, stake works, and production facilities maintenance services; and building construction and installation services. In addition, the company provides electric power transmission, cooling installation and air ventilation electricity generation, oil and gas goods storage, information technology activities and other computer services; ready to build areas, housing procurement, and housing area management; develops facilities and infrastructure areas; and hospitality, campgrounds, caravan stops, tourist lodges, and other short-term accommodations. Further, the company owns and operates real estate properties; planning and supervision of construction, civil, building, and electrical mechanical works; telecommunications radios and instrumentation, and repairs/ maintenance and consultancy services. Additionally, it provides construction work cost measurement, calculation, and determination; management consulting, project management construction; industrial engineering, engineering and planning, procurement, and construction; agency, import and export handling, expedition or land transportation, general trade, and information and tourism services; and rents construction equipment; as well as provides building management and system development services, and waste management and recycling services. The company was incorporated in 1953 and is headquartered in Jakarta, Indonesia."
  },
  "PWON.JK": {
    "Industry": "real-estate-diversified",
    "Sector": "Real Estate",
    "Summary": "PT Pakuwon Jati Tbk operates as a real estate developer in Indonesia. It operates through Office, Shopping Center Business, and Service Apartment; Real Estate; and Hospitality segments. The company is involved in the land acquisition, property development, marketing, and operational management activities. Its property portfolio comprises retail, residential, commercial, and hospitality developments, as well as mixed-use developments of retail shopping malls, offices, condominiums, and hotels. The company was founded in 1982 and is based in Surabaya, Indonesia. PT Pakuwon Jati Tbk is a subsidiary of PT Pakuwon Arthaniaga."
  },
  "ROTI.JK": {
    "Industry": "packaged-foods",
    "Sector": "Consumer Defensive",
    "Summary": "PT Nippon Indosari Corpindo Tbk engages in the bakery and cakes business in Indonesia. The company offers white bread, sweet breads, cakes, and others. It also engages in the processing of dairy product, fruit and vegetable, juice, and soft drink; and whole sale of bakery products, non-alcohol beverages, non-dairy products, milk and dairy products, food from chocolate, and confectionary of chocolate. The company sells its products to distributors and agents. The company was formerly known as PT Nippon Indosari Corporation and changed its name to PT Nippon Indosari Corpindo Tbk in 2003. PT Nippon Indosari Corpindo Tbk was incorporated in 1995 and is headquartered in Bekasi, Indonesia."
  },
  "SDRA.JK": {
    "Industry": "banks-regional",
    "Sector": "Financial Services",
    "Summary": "PT Bank Woori Saudara Indonesia 1906 Tbk engages in the provision of various commercial banking products and services for individuals and businesses in Indonesia. The company provides current and savings accounts, and time and demand deposits; working capital, employee, worker, and franchise loans; car loans; micro, small, and medium enterprises loans; and corporate and mortgage loans. It offers remittance collection/clearing, ATM, credit card and telephone bill payment, bancassurance, bank mediation, international and Internet banking, state revenue, bonds, and electronic data capture services. The company was founded in 1906 and is headquartered in Jakarta, Indonesia. PT Bank Woori Saudara Indonesia 1906 Tbk operates as a subsidiary of Woori Bank."
  },
  "SIDO.JK": {
    "Industry": "drug-manufacturers-specialty-generic",
    "Sector": "Healthcare",
    "Summary": "PT Industri Jamu dan Farmasi Sido Muncul Tbk provides herbal medicines, cosmetics, and foods and beverage products in Indonesia. The company operates through Herbal Medicine and Supplements, Food and Beverage, and Pharmacy segments. It also offers ethical and OTC products for various health interests, including ache and pain relief, antibiotics, anemia, anti-allergy, antioxidants, blood pressure, brain function, bone health, children's health, cold, flu, and cough, as well as diabetes, digestion, energy and vitality, heart and cholesterol, immune system, joints and mobility, liver and detox, men's health, skin health, sleep aids, tumor and cancer, weight management, women's health, and others. In addition, it is involved in commerce, land transportation, wastewater treatment, and plantation and printing activities. The company was founded in 1940 and is headquartered in Semarang, Indonesia. PT Industri Jamu dan Farmasi Sido Muncul Tbk is a subsidiary of PT Hotel Candi Baru."
  },
  "SILO.JK": {
    "Industry": "medical-care-facilities",
    "Sector": "Healthcare",
    "Summary": "PT Siloam International Hospitals Tbk, together with its subsidiaries, provides healthcare services in Indonesia. It also engages in setting up and managing hospitals. The company offers specialist and general medical services, including complex surgical procedures, laboratory services, radiology and imaging services, diagnostic, and emergency services. Its hospitals provide services in the areas of pediatrics, neurology, ENT, general surgery, emergency, nephrology, cardiology, oncology, obstetrics and gynecology, gastroenterology, ophthalmology, pulmonology, internal medicines, orthopedics, urology, anesthesiology, dentistry, dermatology, geriatric and nuclear medicines, pathology, plastic surgery, and psychiatry. The company operates 41 hospitals and 66 clinics with 8,500 beds in Sumatra, Java, Bali, Kalimantan, Sulawesi, Nusa Tenggara Timur, Nusa Tenggara Barat, and Bangka. In addition, it engages in trading, development, mining, agriculture, service, land transportation, industry, printing, plantation, forestry, electrical, mechanical, engineering, construction, and real estate businesses; computer programming activities; provision of management consulting, trust, financing, financial entities, retail, professional, and scientific and technical activities; and web portal and/or digital platform business. The company was formerly known as PT Sentralindo Wirasta. PT Siloam International Hospitals Tbk was founded in 1996 and is headquartered in Tangerang, Indonesia."
  },
  "SIMP.JK": {
    "Industry": "packaged-foods",
    "Sector": "Consumer Defensive",
    "Summary": "PT Salim Ivomas Pratama Tbk, together with its subsidiaries, operates as an integrated producer of edible oils and fats in Indonesia, China, Singapore, Nigeria, Timor Leste, the Philippines, Haiti, Myanmar, Germany, the United States, and internationally. It operates in two segments, Plantations, and Edible Oil and Fats. The Plantations segment develops and maintenances bearer plants, such as oil palm, rubber, sugar cane, and timber plantations with cocoa, coconut, tea plantations and agroforestry and other business; and processes, markets and sells finished goods and related products. The Edible Oil and Fats segment produces, markets, and sells edible oils, margarines, shortening, fats, and other related products. The company sells its products under the Bimoli, Bimoli Spesial, Happy, Amanda, Delima, Malinda, Palmia, Simas, and Royal Palmia brands. It also engages in oil palm seed breeding activities and oil palm planation and mill; investment and research management, and technical services; transportation services; bulking station; trading and marketing services; house prefabrication industry; sugar cane plantation; artificial primary macronutrients mix fertilizers; and invests in agricultural technology and cultivation business, as well as in forestry and fishery. The company was formerly known as PT Ivomas Pratama and changed its name to PT Salim Ivomas Pratama Tbk in February 1994. The company was founded in 1992 and is based in Jakarta, Indonesia. PT Salim Ivomas Pratama Tbk operates as a subsidiary of Indofood Agri Resources Ltd."
  },
  "SMBR.JK": {
    "Industry": "building-materials",
    "Sector": "Basic Materials",
    "Summary": "PT Semen Baturaja (Persero) Tbk produces and distributes cement in Indonesia. The company provides ordinary portland cement type I, II, and V, as well as portland composite cement; Baturaja mortar cement; and white clay products. PT Semen Baturaja (Persero) Tbk was founded in 1974 and is headquartered in Palembang, Indonesia. PT Semen Baturaja (Persero) Tbk operates as a subsidiary of PT Semen Indonesia (Persero) Tbk."
  },
  "SMGR.JK": {
    "Industry": "building-materials",
    "Sector": "Basic Materials",
    "Summary": "PT Semen Indonesia (Persero) Tbk manufactures, packs, and distributes cement in Indonesia and internationally. It operates through Cement Production and Non-Cement Production segments. The company is also involved in limestone and clay mining; cement bag manufacturing; industrial real estate development and building rental; ready-mix concrete and aggregates quarry production; and consulting, mining, trading, transportation, and construction activities. In addition, it engages in the information system, investment, freight forwarding, stevedoring, sea transportation, service logistic management, outsourcing, and building materials businesses, as well as procures public goods and services. The company was formerly known as PT Semen Gresik (Persero) Tbk and changed its name to PT Semen Indonesia (Persero) Tbk in January 2013. PT Semen Indonesia (Persero) Tbk was founded in 1953 and is headquartered in Jakarta Selatan, Indonesia."
  },
  "SMMT.JK": {
    "Industry": "thermal-coal",
    "Sector": "Energy",
    "Summary": "PT Golden Eagle Energy Tbk, together with its subsidiaries, engages in the coal mining and related activities in Indonesia. The company owns interests in a coal mining concession that covers an area of approximately 3,238 hectares located in District Palaran, Samarinda, East Kalimantan; and coal concessions covering approximately 2,143 hectares located in North Musi Rawas Regency, South Sumatera province. It offers mining support and coal transportation services. The company also exports its products. The company was formerly known as PT Eatertainment International Tbk and changed its name to PT Golden Eagle Energy Tbk in August 2012. PT Golden Eagle Energy Tbk was founded in 1980 and is based in Jakarta, Indonesia. As of October 18, 2023 PT Golden Eagle Energy Tbk operates as subsidiary of PT Geo Energy Investama."
  },
  "SMRA.JK": {
    "Industry": "real-estate-development",
    "Sector": "Real Estate",
    "Summary": "PT Summarecon Agung Tbk engages in the construction and development of real estate properties in Indonesia. The company operates through Property Development, Investment Property, Leisure and Hospitality, and Others segments. It develops and sells houses, commercial buildings, apartments, and residential land and commercial shop houses; manages and leases properties; and provides recreational club facilities. The company develops townships; manages towns; rents shophouses and office buildings; owns leisure and hospitality facilities, such as sports clubs and hotels; and provides health and estate management services. In addition, it manages residential apartments, offices, and other building facilities; and develops infrastructure facilities. Further, the company operates gas stations and hospitals; retails food and beverages; and provides information system and education, as well as trading services. PT Summarecon Agung Tbk was incorporated in 1975 and is headquartered in Jakarta Timur, Indonesia."
  },
  "SOCI.JK": {
    "Industry": "marine-shipping",
    "Sector": "Industrials",
    "Summary": "PT Soechi Lines Tbk provides shipping and marine transportation services in Indonesia. The company operates through two segments, Shipping and Shipyard. It charters vessels to the oil and gas, and chemical companies. In addition, the company offers shipbuilding, dry docking, ship repair, and maintenance services. Further, the company provides management and business consulting services; and business brokerage services. It owns and operates a fleet of 37 vessels. The company was founded in 1970 and is headquartered in Jakarta Pusat, Indonesia. PT Soechi Lines Tbk is a subsidiary of PT Soechi Group."
  },
  "SRTG.JK": {
    "Industry": "asset-management",
    "Sector": "Financial Services",
    "Summary": "PT Saratoga Investama Sedaya Tbk is a private equity and venture capital firm specializing in early stage, growth stage and special situations investments. It primarily invests in natural resources, energy, infrastructure, telecommunication, shipping, pharmaceutical, retail, food and beverage, and consumer goods sectors. The firm seeks to make investments in Indonesia. It focuses on acquisitions that are six to eight times EBITDA. The firm seeks to hold its investments for a period of three to five years. Saratoga Capital Investment was founded in 1997 and is based in Jakarta, Indonesia with an additional office in Singapore, Singapore."
  },
  "STAA.JK": {
    "Industry": "farm-products",
    "Sector": "Consumer Defensive",
    "Summary": "PT Sumber Tani Agung Resources Tbk engages in the planting, harvesting, and cultivation of oil palm in Indonesia. The company is involved in the processing of fresh fruit bunches that produces crude palm oil, palm kernel, palm kernel oil, palm kernel expeller, and palm kernel meal. PT Sumber Tani Agung Resources Tbk was founded in 1970 and is headquartered in Medan, Indonesia."
  },
  "TAPG.JK": {
    "Industry": "farm-products",
    "Sector": "Consumer Defensive",
    "Summary": "PT Triputra Agro Persada Tbk engages in the oil palm plantations and palm oil processing businesses in Indonesia. It produces crude palm oil, palm kernel, slab, and ribbed smoked sheet products. The company is also involved in the rubber plantation; other management consulting; wholesale trading; construction; and mining activities. As of December 31, 2021, it operated approximately 85,086 hectares of total planted area of palm oil plantations. The company was formerly known as PT. Alam Permata Indah and changed its name to PT Triputra Agro Persada Tbk in March 2005. PT Triputra Agro Persada Tbk was founded in 2005 and is headquartered in Jakarta Selatan, Indonesia."
  },
  "TCID.JK": {
    "Industry": "household-personal-products",
    "Sector": "Consumer Defensive",
    "Summary": "PT. Mandom Indonesia Tbk manufactures and trades in cosmetics for men and women in Indonesia. It offers hair care products, including hair vitamin and hair color products; and skin care, body care, and makeup products, as well as sprays, deodorants, fragrances, cleansing materials, and plastic containers. The company markets its products under the JOHNNY ANDREAN, TANCHO, FRESH N FRESH, LUCIDO-L, PIXY, PUCELLE, MIRATONE, LOVILLEA, GATSBY, MANDOM, COLOR COMM, SPALDING, GLAZELLE de Pucelle, and STYLE UP brands. Its sells its products in the United Arab Emirates, Malaysia, Japan, Thailand, the Philippines, India, Singapore, Korea, Vietnam, China, Hongkong, and Taiwan. The company was formerly known as PT Tancho Indonesia and changed its name to PT. Mandom Indonesia Tbk in 2001. The company was incorporated in 1969 and is headquartered in Jakarta, Indonesia. PT. Mandom Indonesia Tbk is a subsidiary of Mandom Corporation."
  },
  "TRIM.JK": {
    "Industry": "capital-markets",
    "Sector": "Financial Services",
    "Summary": "PT Trimegah Sekuritas Indonesia Tbk engages in the securities brokerage and underwriting, and investment management activities in Indonesia. Its Equity Trading division provides equity sales services in the primary market; and serves as equity brokerage in the secondary market to retail, as well as institutional investors, such as asset management companies, pension funds, and sub-broking clients. The company's Fixed Income Trading division offers selling and transaction services in the primary and secondary market for fixed income instruments, as well as retail government securities and corporate bonds. This division serves insurance companies, fund managers, pension funds, banks, and other distribution partners. Its Investment Banking division provides bonds and equity underwriting services, as well as financial advisory services comprising merger and acquisition, privatization and divestment, valuation, due diligence, corporate restructuring, and financing, as well as operates as an arranger of securities. The company also provides equity, balanced, fixed income, and money market funds for corporations, financial institutions, and pension funds, as well as acts as a mutual funds selling agent. In addition, it offers online trading and transaction financing services. The company was formerly known as PT Trimegah Securities Tbk and changed its name to PT Trimegah Sekuritas Indonesia Tbk in July 2016. PT Trimegah Sekuritas Indonesia Tbk was founded in 1990 and is headquartered in Jakarta, Indonesia."
  },
  "UCID.JK": {
    "Industry": "household-personal-products",
    "Sector": "Consumer Defensive",
    "Summary": "PT Uni-Charm Indonesia Tbk operates in the sanitary napkin industry in Indonesia. It operates through two segments: Diapers and Non Diapers. The company engages in the manufacture and sale of sanitary napkin, night wing, panty liners, and baby diapers; feminine care, baby care, and healthcare; hygienic cleaning paper, cotton cellulose paper products, such as cleaning wipes, napkins, and napkins for babies. It also offers non-woven and tissue papers; and trading services. It serves its products through CHARM, MamyPoko, Lifree, Fitti Pants, Certainty, Silcot, CharmNap Urine Dry, Unicharm 99% Guard Mask, Unicharm 3D Mask, Unicharm 3D Kids Mask, and Unicharm pet brand names. PT Uni-Charm Indonesia Tbk was founded in 1997 and is headquartered in Jakarta Selatan, Indonesia. PT Uni-Charm Indonesia Tbk is a subsidiary of Unicharm Corporation."
  },
  "UNTR.JK": {
    "Industry": "other-industrial-metals-mining",
    "Sector": "Basic Materials",
    "Summary": "PT United Tractors Tbk, together with its subsidiaries, sells and rents heavy equipment in Indonesia. The company operates through six segments: Construction Machinery, Mining Contracting, Coal Mining, Gold and Other Mineral Mining, Construction Industry, and Energy. It also distributes heavy equipment, trucks, cranes, and busses under the Komatsu, UD Trucks, Scania, Bomag, Tadano, and United Tractors names to mining, agriculture, constructions, forestry, as well as material handling and transportation. In addition, it sells and leases tractors, generators, forklifts, and mini excavators, as well as sells commodity parts. Further, the company offers mining services that supports coal companies, such as mining design and implementation, initial assessment and feasibility study, mining infrastructure and facilities development, land removal and waste management, production and transportation of mining materials, expansion of mine/ facility, reclamation and re-vegetation, and shipping and marketing, as well as owns interests in various coal mine concessions; and provides technical and construction services for building, civil, and maritime work. Additionally, it engages in the engineering, planning, assembling, and manufacturing components of machinery, tools, parts, and heavy equipment; provision of vessel construction and related repair services; provision of vessel charter and shipping; operating power plants; fishery business; exploration, mining, and mineral processing of gold and silver; and remanufacturing of heavy equipment components. The company was founded in 1972 and is headquartered in Jakarta Timur, Indonesia. PT United Tractors Tbk is a subsidiary of PT Astra International Tbk."
  },
  "UNVR.JK": {
    "Industry": "household-personal-products",
    "Sector": "Consumer Defensive",
    "Summary": "PT Unilever Indonesia Tbk manufactures, markets, and distributes consumer goods in Indonesia. It offers soaps, detergents, dairy based foods, ice creams, savories, soy sauce, cosmetic products, tea-based beverages, and fruit juices. The company provides its products under the Axe, Bango, Buavita, Cif, Citra, Clear, Clear Men, Close Up, Cornetto, Dove, Feast, Feast, Glow & Lovely, Hellmann's, Jawara, Knorr, Lifebuoy, Lipton, Love Beauty & Planet, Lux, Magnum, Molto, Paddle Pop, Pepsodent, Pond's, Pond's Men, Populaire, Rexona, Rinso, Royco, SariWangi, Seru, Simple, St. Ives, Suave, Sunlight, Sunsilk, Superpell, TRESemm, The Vegetarian Butcher, Unilever Professional, Vaseline Men, Viennetta, Vixal, Wall's, Wipol, Zwitsalm, and other brands. It also leases office space. PT Unilever Indonesia Tbk was founded in 1933 and is headquartered in Tangerang, Indonesia. PT Unilever Indonesia Tbk operates as a subsidiary of Unilever PLC."
  },
  "WOMF.JK": {
    "Industry": "credit-services",
    "Sector": "Financial Services",
    "Summary": "PT Wahana Ottomitra Multiartha Tbk, together with its subsidiaries, engages in consumer financing activities in Indonesia. The company offers investment financing and working capital financing services, such as finance lease, sale and leaseback, factoring, project financing, and infrastructure financing, and other financing services. It also provides financing services for new and used two-wheeled and four-wheeled motor vehicles. The company was founded in 1982 and is headquartered in Jakarta Utara, Indonesia. PT Wahana Ottomitra Multiartha Tbk operates as a subsidiary of PT Bank Maybank Indonesia Tbk."
  }
}
